{
  "ticker": "BRG",
  "tickerFull": "BRG.AX",
  "exchange": "ASX",
  "company": "Breville Group",
  "sector": "Consumer Discretionary",
  "sectorSub": "Premium Kitchen Appliances",
  "price": 32.95,
  "currency": "A$",
  "date": "20 February 2026",
  "reportId": "BRG-2026-001",
  "priceHistory": [
    37.12,
    36.94,
    36.68,
    36.55,
    36.95,
    36.94,
    36.97,
    36.45,
    36.72,
    36.6,
    36.22,
    36.44,
    36.72,
    36.53,
    36.48,
    36.07,
    36.08,
    35.97,
    35.98,
    36.44,
    36.16,
    35.76,
    36.36,
    35.94,
    35.71,
    36.03,
    35.74,
    35.77,
    35.89,
    35.5,
    35.68,
    35.49,
    35.52,
    35.29,
    35.22,
    35.52,
    35.35,
    35.33,
    35.18,
    35.43,
    35.33,
    35.09,
    35.4,
    34.99,
    34.82,
    34.78,
    35.27,
    34.88,
    35.17,
    35.14,
    34.99,
    34.92,
    34.85,
    34.58,
    34.7,
    34.83,
    34.35,
    34.37,
    34.26,
    34.07,
    34.2,
    34.27,
    33.89,
    34.42,
    34.24,
    33.97,
    34.33,
    33.78,
    33.97,
    33.98,
    34,
    33.89,
    34.05,
    33.46,
    33.64,
    33.46,
    33.72,
    33.32,
    33.26,
    33.23,
    33.67,
    33.56,
    33.35,
    33.56,
    32.97,
    33.13,
    32.86,
    33.11,
    32.88,
    33.29,
    32.86,
    32.85,
    33.11,
    32.63,
    32.89,
    32.96,
    32.72,
    32.79,
    32.33,
    32.28,
    32.32,
    32.61,
    32.15,
    32.49,
    32.31,
    32.4,
    32.16,
    32.33,
    32.02,
    32.1,
    32.09,
    32.11,
    32.23,
    32.23,
    32.11,
    31.71,
    31.84,
    31.44,
    31.74,
    31.39,
    31.78,
    31.27,
    31.23,
    31.21,
    31.43,
    31.66,
    31.21,
    31.01,
    31.12,
    31.09,
    31.11,
    31.24,
    30.83,
    30.76,
    30.72,
    31.1,
    30.75,
    30.78,
    30.9,
    30.54,
    30.66,
    30.81,
    30.33,
    30.8,
    30.27,
    30.52,
    30.67,
    30.41,
    30.47,
    30.49,
    30.28,
    30.18,
    30.31,
    30.15,
    30.14,
    30.16,
    29.78,
    29.7,
    29.72,
    29.98,
    29.98,
    29.46,
    29.52,
    29.74,
    29.44,
    29.69,
    29.76,
    29.63,
    29.62,
    29.62,
    29.34,
    29.15,
    29.33,
    29,
    29.19,
    29.15,
    29.14,
    28.99,
    29.17,
    28.93,
    29.08,
    28.78,
    29.09,
    28.64,
    28.97,
    28.96,
    28.76,
    28.7,
    28.77,
    28.43,
    28.44,
    28.45,
    28.13,
    28.14,
    28.42,
    28.42,
    28.03,
    28.23,
    27.92,
    28.14,
    28.21,
    28.17,
    28.38,
    28.1,
    28.2,
    28.39,
    28.75,
    28.9,
    28.82,
    28.85,
    28.77,
    28.84,
    28.86,
    29.16,
    29.02,
    29.19,
    29.51,
    29.32,
    29.7,
    29.94,
    29.55,
    30.01,
    30.08,
    30.14,
    30.39,
    30.08,
    30.48,
    30.32,
    30.3,
    30.46,
    30.74,
    30.48,
    30.72,
    30.85,
    30.87,
    31.27,
    30.95,
    30.99,
    31.12,
    31.18,
    31.58,
    31.71,
    31.97,
    31.92,
    32.11,
    31.8,
    32.27,
    32.2,
    31.97,
    32.19,
    32.56,
    32.48
  ],
  "heroDescription": "Premium Appliances &bull; A$4.7B Mkt Cap &bull; Sage Brand Europe",
  "heroCompanyDescription": "Breville Group (ASX: BRG) is a global premium kitchen appliance company operating the Breville brand (Americas, Asia-Pacific) and the Sage brand (Europe, UK, Middle East). The company designs and markets high-end espresso machines, juicers, food processors, toasters, and cooking appliances across 70+ countries. In 1H FY26 (reported February 2026), Breville delivered revenue of A$1,098.7M (+10.1%) and maintained EBIT growth despite gross margin compression from US tariff impacts. Full-year FY25 revenue was A$1,696.6M (+10.9%) with NPAT of A$135.9M (+14.6%).",
  "heroMetrics": [
    {
      "label": "Mkt Cap",
      "value": "A$4.7B",
      "colorClass": ""
    },
    {
      "label": "Trailing P/E",
      "value": "35.4x",
      "colorClass": "premium"
    },
    {
      "label": "Rev Growth",
      "value": "+10.1%",
      "colorClass": "positive"
    },
    {
      "label": "Gross Margin",
      "value": "35.4%",
      "colorClass": "negative"
    },
    {
      "label": "Div Yield",
      "value": "1.2%",
      "colorClass": ""
    }
  ],
  "skew": {
    "direction": "neutral",
    "rationale": "Breville is a well-managed premium brand with consistent revenue growth, but US tariff impacts are compressing gross margins (35.4% from 36.7%) and the 35.4x trailing P/E prices in sustained execution. The Sage brand in Europe is the key growth optionality. The central question is whether tariff headwinds are temporary (BRG can reprice) or structural (competitors with lower-cost production advantage persist)."
  },
  "verdict": {
    "text": "Breville delivered 1H FY26 revenue of A$1,098.7M (+10.1%), maintaining double-digit growth but at a cost: gross margin compressed to <strong>35.4% from 36.7%</strong> as US tariff impacts flowed through. FY26 guidance calls for a <strong>slight EBIT increase</strong> versus FY25's A$204.6M EBIT — implying the company can absorb some margin pressure through pricing and volume. At 35.4x trailing P/E with a 1.2% yield, the stock prices in premium brand durability. The key debate is whether US tariff-driven margin compression is temporary (company can reprice over 6-12 months) or persistent (competitors with lower-cost production structures gain share).",
    "borderColor": "var(--accent-gold)",
    "scores": [
      {
        "label": "T1 Americas Growth",
        "score": "40%",
        "scoreColor": "var(--signal-green)",
        "dirArrow": "&rarr;",
        "dirText": "Monitoring",
        "dirColor": null
      },
      {
        "label": "T2 Sage Europe",
        "score": "30%",
        "scoreColor": "var(--accent-gold)",
        "dirArrow": "&uarr;",
        "dirText": "Building",
        "dirColor": "var(--accent-gold)"
      },
      {
        "label": "T3 Consumer Slowdown",
        "score": "35%",
        "scoreColor": "var(--signal-amber)",
        "dirArrow": "&rarr;",
        "dirText": "Watching",
        "dirColor": "var(--signal-amber)"
      },
      {
        "label": "T4 Tariff Margins",
        "score": "20%",
        "scoreColor": "var(--signal-red)",
        "dirArrow": "&uarr;",
        "dirText": "Elevated",
        "dirColor": "var(--signal-red)"
      }
    ]
  },
  "featuredMetrics": [
    {
      "label": "Mkt Cap",
      "value": "A$4.7B",
      "color": ""
    },
    {
      "label": "Revenue 1H",
      "value": "A$1,099M (+10%)",
      "color": "var(--signal-green)"
    },
    {
      "label": "Gross Margin",
      "value": "35.4% (↓ 130bps)",
      "color": "var(--signal-amber)"
    },
    {
      "label": "FY26 EBIT Guid.",
      "value": "Slight increase",
      "color": "var(--accent-gold)"
    }
  ],
  "featuredPriceColor": "var(--accent-gold)",
  "featuredRationale": "Consistent revenue growth (+10%+) with a premium brand moat, but US tariff-driven gross margin compression to 35.4% is the key near-term headwind. 35.4x P/E prices in continued execution.",
  "identity": {
    "rows": [
      [
        [
          "Ticker",
          "BRG.AX",
          "td-mono"
        ],
        [
          "Exchange",
          "ASX",
          "td-mono"
        ]
      ],
      [
        [
          "Market Cap",
          "A$4.7B",
          "td-mono"
        ],
        [
          "Sector",
          "Consumer Discretionary / Appliances",
          "td-mono"
        ]
      ],
      [
        [
          "Share Price",
          "A$32.95",
          "td-mono"
        ],
        [
          "52-Week Range",
          "A$24.33 &ndash; A$37.11",
          "td-mono"
        ]
      ],
      [
        [
          "Trailing P/E",
          "35.4x",
          "td-mono td-amber"
        ],
        [
          "Div Yield",
          "1.2%",
          "td-mono"
        ]
      ],
      [
        [
          "FY25 Revenue",
          "A$1,696.6M (+10.9%)",
          "td-mono td-green"
        ],
        [
          "FY25 NPAT",
          "A$135.9M (+14.6%)",
          "td-mono td-green"
        ]
      ],
      [
        [
          "FY25 EBIT",
          "A$204.6M",
          "td-mono td-green"
        ],
        [
          "FY25 EBIT Margin",
          "~12.1%",
          "td-mono"
        ]
      ],
      [
        [
          "1H FY26 Revenue",
          "A$1,098.7M (+10.1%)",
          "td-mono td-green"
        ],
        [
          "1H Gross Margin",
          "35.4% (vs 36.7% pcp)",
          "td-mono td-amber"
        ]
      ],
      [
        [
          "FY26 EBIT Guidance",
          "Slight increase vs FY25",
          "td-mono"
        ],
        [
          "Geography",
          "Americas, Europe, APAC, 70+ countries",
          "td-mono"
        ]
      ],
      [
        [
          "Brands",
          "Breville (Americas/APAC); Sage (Europe)",
          "td-mono"
        ],
        [
          "Reporting Currency",
          "A$",
          "td-mono"
        ]
      ],
      [
        [
          "CEO",
          "Jim Clayton",
          ""
        ],
        [
          "Employees",
          "~1,800",
          "td-mono"
        ]
      ]
    ],
    "overview": "Breville Group is Australia's most successful global consumer brand export — a premium kitchen appliance company with genuine pricing power in a competitive global market. The Breville brand commands premium positioning in espresso machines, juicers, food processors, and smart cooking appliances across North America, APAC, and increasingly online. The Sage brand (acquired via acquisition of Sage Appliances in 2020) performs the same role in Europe and the UK, where premium espresso culture is deeply embedded. The company is pursuing a strategy of product innovation (connected appliances, barista-grade home espresso), geographic expansion (Continental European Sage penetration), and new product categories (cooking, food preparation). FY26 margin pressure is the immediate challenge: US tariffs on Asian-manufactured goods (Breville manufactures primarily in China and Vietnam) have compressed gross margins, and the company is working to offset this through pricing, mix shift, and supply chain diversification."
  },
  "hypotheses": [
    {
      "tier": "d1",
      "direction": "upside",
      "title": "D1: North American Premiumisation Drives Revenue Re-Acceleration",
      "statusClass": "accumulating",
      "statusText": "Monitoring &mdash; Margin Recovery Critical",
      "score": "40%",
      "scoreWidth": "40%",
      "scoreMeta": "&rarr; Revenue growth intact; margin recovery awaited",
      "description": "North American consumers continue to trade up to premium kitchen appliances, driven by the 'home barista' trend, premiumisation in cooking and food preparation, and strong brand loyalty to Breville in the coffee category. As US tariff impacts are offset by pricing increases and supply chain diversification (Vietnam, other low-cost jurisdictions), gross margins recover toward 37-38%, and Breville's operating leverage drives EBIT margin expansion above 13%.",
      "requires": [
        "US gross margins recover toward 37.0-37.5% by FY27 as tariff cost pass-through takes effect",
        "North American revenue growth sustains at 8-10% pa, driven by espresso machine and cooking appliance category growth",
        "New product launches in connected appliances and barista-grade espresso machines resonate with premium US consumer",
        "Supply chain diversification (Vietnam, other) reduces China tariff exposure to below 30% of production value",
        "No material increase in US tariff rates beyond current levels on relevant HS codes"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Filings:</strong> Revenue growth of +10.1% in 1H FY26 confirms consumer demand for Breville products despite price increases and tariff pass-through",
        "<strong>Corporate:</strong> CEO Jim Clayton confirmed pricing actions underway to recover margin; supply chain diversification to Vietnam and other markets is progressing",
        "<strong>Economic:</strong> US premium consumer spending (household income >US$100K) has remained resilient despite cost-of-living pressures — core Breville demographic",
        "<strong>Competitor:</strong> De'Longhi (Italian, Breville's closest premium competitor) has also taken pricing action globally — industry-wide price movement validates Breville's approach",
        "<strong>Filings:</strong> FY25 NPAT growth of +14.6% on revenue growth of +10.9% demonstrates operating leverage is functioning"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Filings:</strong> Gross margin compression from 36.7% to 35.4% (130bps decline) shows pricing has not yet fully offset tariff costs — recovery timeline is uncertain",
        "<strong>Economic:</strong> US consumer sentiment is mixed; premium discretionary goods (not essentials) face pressure when inflation erodes real wages",
        "<strong>Competitor:</strong> Asian manufacturers (specifically Korean and Chinese premium appliance brands) have cost structures that are structurally cheaper at current tariff levels",
        "<strong>Academic:</strong> Price elasticity in premium appliances shows that sustained price increases of >10% typically drive some volume trade-down"
      ]
    },
    {
      "tier": "d2",
      "direction": "upside",
      "title": "D2: European Sage Brand Accelerates Revenue Mix Shift",
      "statusClass": "accumulating",
      "statusText": "Evidence Building",
      "score": "30%",
      "scoreWidth": "30%",
      "scoreMeta": "&uarr; European penetration opportunity large",
      "description": "The Sage brand in Europe is years behind Breville's penetration in North America, representing a large structural growth opportunity. As Breville expands Sage distribution across Continental Europe (France, Germany, Spain, Italy), and European espresso culture drives premium machine purchases, Sage revenue grows at 15-20% pa — materially above the group average — and shifts the earnings mix toward higher-margin European markets.",
      "requires": [
        "Sage European revenue grows at 15%+ pa in FY26 and FY27",
        "European distribution expansion in France, Germany, and Spain proceeds on plan",
        "Sage brand awareness and retail presence grows without requiring excessive marketing spend that erodes margins",
        "European consumer sentiment supports premium appliance purchases (particularly post-cost-of-living squeeze)",
        "USD/EUR dynamics do not significantly erode the AUD value of European earnings"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Corporate:</strong> CEO Jim Clayton explicitly cited European Sage expansion as a strategic priority in FY25 and FY26 investor presentations",
        "<strong>Competitor:</strong> De'Longhi's European premium segment is growing at double-digit rates — the market exists and is expanding",
        "<strong>Economic:</strong> European specialty coffee culture (particularly in France and Germany) is growing, driving demand for premium home espresso equipment",
        "<strong>Filings:</strong> Sage brand revenues are not separately disclosed, but management commentary confirms sustained growth in European markets",
        "<strong>Academic:</strong> Premium brand expansion into new geographies via established distribution channels (existing UK/Ireland Sage distribution as beachhead) is a proven playbook"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Economic:</strong> European consumer confidence has been constrained by energy cost shocks and cost-of-living pressures since 2022-2023, reducing willingness to spend on premium appliances",
        "<strong>Competitor:</strong> Miele, Siemens, and local European premium brands have deep distribution relationships that take years to displace",
        "<strong>Filings:</strong> European operations are not separately disclosed — growth rate is unverifiable from public data; management's narrative is the primary data source",
        "<strong>Economic:</strong> EUR/AUD movements could offset revenue growth in AUD terms if the AUD strengthens"
      ]
    },
    {
      "tier": "d3",
      "direction": "downside",
      "title": "D3: Consumer Discretionary Slowdown Pressures Premium Demand",
      "statusClass": "monitoring",
      "statusText": "Monitoring &mdash; Macro Watch",
      "score": "35%",
      "scoreWidth": "35%",
      "scoreMeta": "&rarr; Watching US consumer sentiment",
      "description": "Premium discretionary goods face headwinds as US and European consumers pull back on non-essential spending. Breville's revenue growth slows materially below 10% as the 'home barista' boom normalises post-COVID, retailers reduce inventory orders, and consumers trade down to lower-priced alternatives. With margins already compressed by tariffs, a revenue slowdown would simultaneously pressure top-line and bottom-line, de-rating the stock from 35x to 20-25x P/E.",
      "requires": [
        "US consumer confidence falls materially in H1 2026 due to tariff-driven price inflation",
        "Premium appliance category growth decelerates to below 5% in North America and Europe",
        "Retail inventory de-stocking causes demand orders to underperform consumer sell-through",
        "BRG revenue growth falls below 5% for a consecutive half-year period",
        "De'Longhi and other competitors gain market share through aggressive discounting"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Economic:</strong> US tariffs on consumer goods are effectively a consumption tax; higher prices for appliances reduce affordability for aspirational buyers",
        "<strong>Economic:</strong> University of Michigan consumer sentiment index has shown elevated uncertainty in early 2026 due to tariff policy unpredictability",
        "<strong>Competitor:</strong> Large appliance retailers (Best Buy, Williams-Sonoma) have flagged mixed consumer spending signals for FY26",
        "<strong>Academic:</strong> Premium consumer spending is more income-elastic than basic goods; it correlates with confidence and wealth effects"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Filings:</strong> 1H FY26 revenue of +10.1% demonstrates demand is holding despite tariff price pass-through",
        "<strong>Economic:</strong> US employment is strong; upper-income consumer (Breville's core demographic) has been more resilient than lower-income cohorts",
        "<strong>Corporate:</strong> Breville's category (espresso machines, premium cooking) has shown lower cyclicality than big-ticket appliances (white goods)",
        "<strong>Competitor:</strong> De'Longhi continued to grow in H2 2025 despite the macro — suggests the premium category is more resilient than feared"
      ]
    },
    {
      "tier": "d4",
      "direction": "downside",
      "title": "D4: US Tariff + Competitive Intensity Erodes Margin Structurally",
      "statusClass": "minimal",
      "statusText": "Elevated Risk — Monitoring",
      "score": "20%",
      "scoreWidth": "20%",
      "scoreMeta": "&uarr; Watching tariff policy",
      "description": "US tariffs on Chinese and Vietnamese manufactured goods remain elevated or escalate further. Breville's supply chain diversification (to Vietnam and other markets) is insufficient to fully offset the cost impact. Simultaneously, Asian competitors with lower production costs and tariff advantages gain share in the US premium appliance market. Breville's gross margin structurally erodes toward 33-34%, making the current 35x P/E unsustainable. The stock de-rates as the market reprices the margin profile.",
      "requires": [
        "US tariff rates on Chinese-manufactured consumer goods sustained at 25%+ for more than 18 months",
        "Vietnam and other diversification destinations also face US tariff escalation",
        "Asian competitors (e.g., Korean premium brands, Xiaomi's premium sub-brands) gain meaningful US market share",
        "Breville is unable to fully pass tariff costs to consumers (price elasticity limits offset)",
        "Gross margin remains below 36% for 3 consecutive half-year periods"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Filings:</strong> 1H FY26 gross margin compressed 130bps to 35.4% — early evidence of structural margin erosion from tariffs",
        "<strong>Economic:</strong> The Trump administration's tariff policy shows no sign of reversal; uncertainty may persist through the full political cycle",
        "<strong>Competitor:</strong> Asian manufacturers operating from tariff-favoured jurisdictions (Mexico for some, Korea for others) have structural cost advantages",
        "<strong>Economic:</strong> Supply chain diversification from China to Vietnam takes 2-4 years to fully execute — margin headwinds persist in the interim"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Corporate:</strong> Breville's pricing power in the premium segment is well-established; De'Longhi's ability to pass through tariffs demonstrates the category can absorb price increases",
        "<strong>Filings:</strong> FY26 guidance for 'slight EBIT increase' implies management believes the margin headwind is manageable",
        "<strong>Economic:</strong> US-Vietnam bilateral relations are constructive; Vietnam tariffs are lower than China tariffs and exemptions exist for some consumer goods",
        "<strong>Competitor:</strong> No Asian competitor currently matches Breville's product quality and brand equity in the premium espresso/cooking category"
      ]
    }
  ],
  "narrative": {
    "theNarrative": "Breville is a genuine premium brand success story — Australian-designed, globally distributed, with a product portfolio that generates real pricing power. The narrative has been <strong>\"Breville is Australia's best consumer brand\"</strong> for most of the last decade, and the stock has re-rated accordingly from sub-20x to 35x+ P/E. The 1H FY26 result confirmed revenue growth remains intact (+10.1%), but the <span class=\"key-stat down\">gross margin compression to 35.4%</span> from US tariffs has introduced a question the market hasn't had to answer before: <strong>is Breville's margin profile structural or is it being eroded by cost headwinds it cannot fully control?</strong> At 35x trailing earnings, the stock prices in continued premium execution. The margin recovery — or its absence — over the next 12 months is the defining variable.",
    "priceImplication": {
      "label": "Embedded Assumptions at A$32.95",
      "content": "<strong>Revenue growth sustains 8-10% pa:</strong> Market expects double-digit revenue growth to continue through FY26-FY28. <strong>Gross margin recovers toward 37%:</strong> Market assumes tariff pass-through pricing restores margins — not yet evidenced. <strong>Sage Europe accelerates:</strong> European expansion is a long-dated option embedded in the premium multiple. <strong>Operating leverage intact:</strong> EBIT margin expansion from current ~12% toward 13-14% as scale grows. <strong>No material tariff escalation:</strong> Current US tariff levels are the ceiling, not the floor."
    },
    "evidenceCheck": "The revenue growth evidence is strong and consistent — Breville has now delivered 10%+ revenue growth for multiple consecutive periods. The margin evidence is more concerning: the 130bps compression in 1H FY26 is real and unambiguous. <strong>The key question is speed of recovery.</strong> If Breville can restore margins to 37%+ by 1H FY27 through pricing and supply chain actions, the current multiple is defensible. If margins remain at 35-36% for more than 2 years, the 35x P/E becomes increasingly difficult to justify against a consumer discretionary business with mid-teens EBIT margins.",
    "narrativeStability": "<strong>Stable but margin-dependent.</strong> The Breville brand narrative (premium, innovative, pricing power) is intact and unlikely to shift dramatically in either direction in the near term. The narrative would shift bearish if: (1) 1H FY27 gross margin remains below 36%; (2) revenue growth decelerates below 5%; (3) tariff escalation accelerates beyond current levels. The narrative would shift more bullish if Sage Europe begins to show accelerating growth that the market hasn't yet priced in."
  },
  "evidence": {
    "intro": "Ten evidence domains assessed across Breville's 1H FY26 result, US tariff impacts, European Sage opportunity, and consumer spending dynamics. The brand and revenue evidence is strong; the margin trajectory is the key uncertainty.",
    "cards": [
      {
        "number": 1,
        "title": "1. Corporate Communications",
        "epistemicClass": "ep-motivated",
        "epistemicLabel": "Motivated",
        "finding": "Breville's 1H FY26 results presentation framed the tariff-driven margin compression as a known headwind being actively managed. Key management messages: (1) Revenue growth of +10.1% demonstrates the brand is holding consumer demand; (2) Pricing actions are underway and will take 1-2 halves to fully flow through; (3) Supply chain diversification to Vietnam and other markets is on schedule; (4) FY26 EBIT guidance maintained at a 'slight increase' versus FY25's A$204.6M EBIT. CEO Jim Clayton emphasised product innovation (new connected appliance launches, upgraded espresso machine ranges) as the primary driver of sustained premium positioning. The Sage brand in Europe received specific management commentary as a major growth optionality.",
        "tension": "Management's characterisation of tariff headwinds as 'temporary and manageable' is motivated — the alternative (admitting structural margin erosion) would be more severely punished by the market. The 1-2 half recovery timeline for pricing actions to offset tariff costs is an estimate, not a commitment. If the AUD strengthens or tariffs escalate, the recovery takes longer.",
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (demand holding despite price increases)",
            "class": "supports"
          },
          {
            "text": "Supports T2 (Sage Europe highlighted)",
            "class": "supports"
          },
          {
            "text": "Management framing T4 risk as temporary — watch for confirmation",
            "class": "neutral"
          }
        ],
        "source": "Breville 1H FY26 Results; ASX Release February 2026; Investor Presentation"
      },
      {
        "number": 2,
        "title": "2. Regulatory Filings &amp; Financial Statements",
        "epistemicClass": "ep-statutory",
        "epistemicLabel": "Under Oath / Statutory",
        "finding": "<strong>1H FY26 key financials:</strong> Revenue A$1,098.7M (+10.1%), gross profit approximately A$389M (gross margin 35.4% vs 36.7% pcp — 130bps compression). EBIT approximately A$100M (implied, with FY26 guidance for slight increase on FY25 A$204.6M full year). Net debt manageable. <strong>FY25 full-year review:</strong> Revenue A$1,696.6M (+10.9%), NPAT A$135.9M (+14.6%), EBIT A$204.6M, EPS approximately A$0.957/share. Dividend approximately A$0.38/share (1.2% yield). <strong>Geographic mix:</strong> Americas represents the largest revenue segment; Europe (Sage) is the fastest-growing. The gross margin compression is explicitly attributed to US tariff impacts flowing through cost of goods sold from Asian manufacturing.",
        "tension": "The statutory gross margin figure of 35.4% is the most important data point in the 1H FY26 results. It confirms that US tariffs are having a measurable, negative impact on profitability — this cannot be attributed to revenue mix or one-off costs. The compression trajectory (130bps in one half) is significant.",
        "table": {
          "headers": [
            "Metric",
            "1H FY26",
            "1H FY25",
            "Change"
          ],
          "rows": [
            [
              "Revenue (A$M)",
              "1,098.7",
              "~998.1",
              "+10.1%"
            ],
            [
              "Gross Margin (%)",
              "35.4%",
              "36.7%",
              "-130bps"
            ],
            [
              "FY25 Full-Year NPAT",
              "A$135.9M",
              "A$118.6M (FY24)",
              "+14.6%"
            ],
            [
              "FY25 Full-Year Revenue",
              "A$1,696.6M",
              "A$1,529.9M",
              "+10.9%"
            ],
            [
              "FY26 EBIT Guidance",
              "Slight increase vs A$204.6M",
              "A$204.6M (FY25)",
              "Maintained"
            ]
          ]
        },
        "tags": [
          {
            "text": "Supports T1 (revenue growth intact)",
            "class": "supports"
          },
          {
            "text": "Strongly Supports T4 (gross margin compression confirmed)",
            "class": "strong"
          },
          {
            "text": "Neutral on T2 (European segment not separately disclosed)",
            "class": "neutral"
          }
        ],
        "source": "Breville 1H FY26 Half-Year Report; ASX Filing February 2026; FY25 Annual Report"
      },
      {
        "number": 3,
        "title": "3. Broker Research",
        "epistemicClass": "ep-consensus",
        "epistemicLabel": "Consensus",
        "finding": "<strong>Broker consensus is constructive but acknowledges the margin headwind.</strong> Of approximately 9 covering analysts: 7 Buy, 2 Hold. Average 12-month price target approximately A$36.50-38.00, implying ~10-15% upside from A$32.95. <strong>Bull case (Macquarie, UBS, Jarden):</strong> brand moat is durable, revenue growth is consistent, Sage Europe is underappreciated, and tariff headwinds will normalise over 12-18 months. <strong>Neutral case (2 Hold-rated brokers):</strong> 35x P/E is full valuation for a consumer discretionary business with compressed margins; tariff risk is harder to model than management suggests. <strong>Key model debate:</strong> Whether FY27 gross margin recovers to 37%+ (bulls) or stays around 35-36% (bears). This single variable drives most of the dispersion in analyst price targets.",
        "tension": "The high Buy ratio (7 of 9) for a stock trading at 35x in a margin compression environment suggests sell-side consensus may be anchored to prior estimates rather than fully incorporating the structural margin risk.",
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (revenue growth consensus)",
            "class": "supports"
          },
          {
            "text": "Supports T2 (Sage Europe optionality underappreciated per bulls)",
            "class": "supports"
          },
          {
            "text": "Partially supports T4 (Hold-rated brokers see tariff risk as structural)",
            "class": "supports"
          }
        ],
        "source": "Macquarie Equities; UBS Research; Jarden; consensus data February 2026"
      },
      {
        "number": 4,
        "title": "4. Competitor &amp; Industry Data",
        "epistemicClass": "ep-independent",
        "epistemicLabel": "Independent",
        "finding": "<strong>Premium kitchen appliance market dynamics are broadly supportive but competitive.</strong> De'Longhi (DLTH.MI) — Breville's closest comparable — delivered consistent revenue growth in 2025 and maintained premium pricing in its coffee appliance segment, validating the category's resilience. De'Longhi's own tariff response (price increases + supply chain adjustment) closely parallels Breville's approach. <strong>Nespresso (Nestl&eacute;):</strong> Continued investment in premium capsule machines — validates the premium coffee segment but also introduces ecosystem competition. <strong>Asian entrants:</strong> Xiaomi and Samsung's premium sub-brands are expanding into small kitchen appliances, but have not credibly entered the super-premium espresso category that drives Breville's EBIT. <strong>Retail data:</strong> Williams-Sonoma, Sur La Table, and Crate &amp; Barrel continue to allocate premium shelf space to Breville — distribution is not under pressure.",
        "tension": "The competitive landscape is more benign than feared for the super-premium segment (>A$500 espresso machines), but Breville's lower-price tiers face more competition from Asian brands with tariff advantages.",
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (De'Longhi validates price increases)",
            "class": "supports"
          },
          {
            "text": "Supports T2 (European premium coffee growing)",
            "class": "supports"
          },
          {
            "text": "Mild support for T4 (Asian competitive entry in lower tiers)",
            "class": "supports"
          }
        ],
        "source": "De'Longhi FY25 results; Nespresso market data; retail industry surveys; Euromonitor kitchen appliance market reports"
      },
      {
        "number": 5,
        "title": "5. Economic Data",
        "epistemicClass": "ep-objective",
        "epistemicLabel": "Objective",
        "finding": "<strong>Three key economic variables:</strong> (1) <strong>US tariffs:</strong> The Trump administration's tariffs on Chinese goods (25%+) and Vietnamese goods (10-25%) directly impact Breville's cost of goods sold. As of early 2026, there is no policy clarity on reversal timeline — uncertainty persists. (2) <strong>US consumer spending:</strong> Upper-income US consumer spending (Breville's core demographic) has remained more resilient than mass-market. Conference Board consumer confidence for households earning >US$75K remains positive, though trending lower since Q3 2025. (3) <strong>AUD/USD:</strong> The AUD trades around US$0.63-0.65, modestly below long-run averages. A weaker AUD is slightly positive for Breville (USD and EUR revenues translate to more AUD), partially offsetting the tariff cost impact.",
        "tension": "The macro environment is creating simultaneous headwinds (tariffs on costs) and modest tailwinds (AUD weakness, relatively resilient premium consumer). The net impact is margin compression, which is what the 1H FY26 results show.",
        "table": null,
        "tags": [
          {
            "text": "Supports T3 (US consumer uncertainty elevated)",
            "class": "supports"
          },
          {
            "text": "Strongly Supports T4 (tariff cost impact confirmed)",
            "class": "strong"
          },
          {
            "text": "Partially mitigates T4 (AUD weakness provides partial offset)",
            "class": "neutral"
          }
        ],
        "source": "US USTR tariff schedules; Conference Board consumer confidence; ABS exchange rate data; US BLS CPI"
      },
      {
        "number": 6,
        "title": "6. Alternative Data",
        "epistemicClass": "ep-behavioural",
        "epistemicLabel": "Behavioural",
        "finding": "<strong>Breville's brand health data is positive across key platforms.</strong> Amazon reviews for Breville Barista Express (flagship espresso machine) maintain 4.7/5.0 ratings with >15,000 reviews — no evidence of product quality decline or consumer backlash to price increases. Google Trends for 'Breville' and 'Sage espresso' show sustained search interest with no material decline. <strong>Retail channel checks:</strong> Williams-Sonoma and Amazon continued featuring Breville at premium price points in Q1 2026. No evidence of inventory de-stocking or retailer promotional discounting that would signal demand weakness. <strong>Social media:</strong> #HomeBarista and #Breville tags on Instagram and TikTok maintain engagement — the 'home barista' aesthetic continues to drive aspirational demand.",
        "tension": "Alternative data is uniformly positive for brand health but does not capture price elasticity at the margin — it shows current demand, not how demand would respond to further price increases if tariffs escalate.",
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (brand health intact)",
            "class": "supports"
          },
          {
            "text": "Contradicts T3 (no evidence of demand slowdown in real data)",
            "class": "contradicts"
          }
        ],
        "source": "Amazon product reviews; Google Trends; Williams-Sonoma retail data; Instagram/TikTok engagement metrics"
      },
      {
        "number": 7,
        "title": "7. Academic Research",
        "epistemicClass": "ep-peerreviewed",
        "epistemicLabel": "Peer-Reviewed",
        "finding": "<strong>Premium brand economics literature supports Breville's pricing power narrative.</strong> Published research on luxury and premium consumer goods (Vigneron &amp; Johnson; Kapferer) establishes that well-positioned premium brands can sustain price premiums of 30-50% over mass-market alternatives without significant volume loss, particularly when the product has functional differentiation. <strong>Tariff pass-through literature:</strong> Research on US tariff impacts (Fajgelbaum et al.) shows that tariffs are largely passed through to consumer prices in premium goods categories — suggesting Breville's pricing approach is empirically justified. <strong>Brand internationalisation:</strong> Research on Australian brands going global is more cautionary — most Australian brands that attempted European expansion required sustained marketing investment over 3-5 years before achieving scale profitability.",
        "tension": null,
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (premium pricing power validated academically)",
            "class": "supports"
          },
          {
            "text": "Supports T2 (but warns European expansion takes 3-5 years)",
            "class": "supports"
          },
          {
            "text": "Supports T4 (tariff pass-through is possible but not guaranteed)",
            "class": "supports"
          }
        ],
        "source": "Journal of Marketing; Journal of Consumer Research; Fajgelbaum et al. (2020) tariff incidence; brand internationalisation literature"
      },
      {
        "number": 8,
        "title": "8. Media &amp; Social",
        "epistemicClass": "ep-noise",
        "epistemicLabel": "Noise",
        "finding": "<strong>Breville receives positive and consistent media coverage as an ASX premium brand success story.</strong> The AFR and business press regularly profile Breville as evidence that Australian companies can build globally recognised consumer brands. 1H FY26 results coverage focused on the revenue growth (+10.1%) and margin challenge (35.4% gross margin). <strong>Key media narrative:</strong> The 'tariff headwind but brand resilience' story. Breville's product appears regularly in lifestyle media (coffee industry blogs, food media, design publications) — brand salience is high. <strong>Retail investor sentiment:</strong> Breville has a significant retail following among ASX investors given its recognisable brand and consistent growth record.",
        "tension": null,
        "table": null,
        "tags": [
          {
            "text": "Supports T1 (brand visibility remains high)",
            "class": "supports"
          },
          {
            "text": "Neutral on T4 (media characterising tariff headwind as temporary)",
            "class": "neutral"
          }
        ],
        "source": "AFR; The Australian; coffee industry media; lifestyle publications; retail investor forums"
      },
      {
        "number": 9,
        "title": "9. Leadership &amp; Governance",
        "epistemicClass": "ep-governance",
        "epistemicLabel": "Independent Assessment",
        "finding": "<strong>Jim Clayton (CEO, since 2020) has an excellent track record of consistent delivery.</strong> Under his tenure, Breville has delivered compound annual revenue growth of approximately 12% and expanded from primarily an Australian/US business to a genuinely global premium brand. His strategic priorities — product innovation, geographic expansion of Sage, and supply chain resilience — are well-articulated and evidenced by results. <strong>Governance:</strong> Breville has a clean governance record with no accounting issues, management changes, or disclosure failures. The board includes strong consumer and international business expertise. <strong>Key risk:</strong> The supply chain diversification programme (China to Vietnam and others) is an execution challenge that requires manufacturing quality control consistency across new facilities.",
        "tension": "Jim Clayton's ability to execute the tariff offset strategy — pricing action + supply chain diversification — in an uncertain policy environment is the key management question for FY26-FY27. His track record is positive but the challenge is larger than anything faced previously.",
        "table": {
          "headers": [
            "Name",
            "Role",
            "Tenure",
            "Background"
          ],
          "rows": [
            [
              "Jim Clayton",
              "CEO",
              "Since 2020",
              "Former COO Breville; deep product and operations expertise"
            ],
            [
              "David Kasparian",
              "CFO",
              "Since 2019",
              "Financial management; capital allocation track record is sound"
            ],
            [
              "Sally Herman",
              "Director",
              "Independent",
              "Extensive FMCG and consumer brand board experience"
            ]
          ]
        },
        "tags": [
          {
            "text": "Supports T1 (management track record strong)",
            "class": "supports"
          },
          {
            "text": "Neutral on T4 (supply chain execution is the key test)",
            "class": "neutral"
          }
        ],
        "source": "Breville Annual Report; ASX Director disclosures; AFR executive profiles"
      },
      {
        "number": 10,
        "title": "10. Ownership &amp; Capital Flows",
        "epistemicClass": "ep-registry",
        "epistemicLabel": "Registry Data",
        "finding": "<strong>Breville has a strong institutional ownership base.</strong> Top holders include: Perpetual (~8%), T. Rowe Price (~6%), Vanguard and BlackRock (combined ~8% passive). <strong>No dominant insider overhang:</strong> The founding Breville family sold down over the decades; current management holds performance rights and restricted stock but not dominant blocks. <strong>Short interest:</strong> Low at approximately 1-2% of free float — market is not betting against Breville. <strong>Capital management:</strong> Breville pays a modest dividend (1.2% yield) and uses excess cash for R&D investment and geographic expansion rather than buybacks. <strong>Index inclusions:</strong> BRG is in the S&P/ASX 200 and S&P/ASX 200 Consumer Discretionary index, providing structural demand from passive funds.",
        "tension": null,
        "table": {
          "headers": [
            "Holder",
            "Type",
            "Approximate Stake",
            "Movement"
          ],
          "rows": [
            [
              "Perpetual",
              "Active",
              "~8%",
              "Long-term core holding"
            ],
            [
              "T. Rowe Price",
              "Active",
              "~6%",
              "International active — building"
            ],
            [
              "Vanguard / BlackRock",
              "Passive",
              "~8% combined",
              "Stable — index weight"
            ],
            [
              "Short sellers",
              "Short",
              "~1-2%",
              "Very low — consensus positive"
            ]
          ]
        },
        "tags": [
          {
            "text": "Supports T1 (strong institutional backing)",
            "class": "supports"
          },
          {
            "text": "Neutral on T4 (no major selling signals)",
            "class": "neutral"
          }
        ],
        "source": "ASX substantial holder notices; ASIC short position reports; Breville Annual Report"
      }
    ],
    "alignmentSummary": null
  },
  "discriminators": {
    "intro": "Three high-diagnosticity variables will resolve the key competing hypotheses for Breville. Gross margin trajectory, Sage Europe growth rate, and US tariff policy developments are the defining data points.",
    "rows": [
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "<strong>1H FY27 gross margin (reported ~February 2027).</strong> Recovery above 37% confirms T1 (tariff headwind transitory). Stable below 36% confirms T4 (structural margin erosion).",
        "discriminatesBetween": "T1 (pricing recovers margins) vs T4 (tariff impact is structural)",
        "currentReading": "1H FY26: 35.4% — watching for recovery trajectory",
        "readingClass": "td-amber"
      },
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "<strong>FY26 full-year EBIT vs guidance of 'slight increase' on A$204.6M.</strong> Delivery confirms management's tariff offset is working. Miss confirms T4 headwind is larger than expected.",
        "discriminatesBetween": "T1/T4 (management tariff offset executing) vs T3 (consumer slowdown compounds tariff issue)",
        "currentReading": "H1 tracking: implied A$205M+ full year possible — watching H2",
        "readingClass": "td-amber"
      },
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "<strong>US tariff policy developments (ongoing).</strong> Any tariff reduction or exemption for consumer goods (including kitchen appliances) from China/Vietnam would directly reduce BRG's cost headwind.",
        "discriminatesBetween": "T4 (structural tariff erosion) vs T1 (tariff policy normalises, margins recover)",
        "currentReading": "No policy reversal signals — tariffs maintained as at Feb 2026",
        "readingClass": "td-red"
      },
      {
        "diagnosticity": "MEDIUM",
        "diagnosticityClass": "disc-med",
        "evidence": "<strong>Sage Europe revenue growth disclosure.</strong> If Breville breaks out Sage Europe growth separately, acceleration above 15% pa confirms T2 (European expansion thesis).",
        "discriminatesBetween": "T2 (Sage Europe optionality materialising) vs base case (European growth inline with group)",
        "currentReading": "Not separately disclosed — monitoring management commentary",
        "readingClass": "td-amber"
      }
    ],
    "nonDiscriminating": "<strong>\"Breville is a great brand\"</strong> (widely known and priced in at 35x P/E) &bull; <strong>\"Premium consumers are resilient\"</strong> (generic statement; doesn't tell us about BRG-specific pricing power at current tariff-elevated prices) &bull; <strong>\"Sage has growth potential in Europe\"</strong> (acknowledged by management and priced in at premium multiple; only becomes discriminating when growth rate is disclosed) &bull; <strong>\"Tariffs are uncertain\"</strong> (true of all companies with Asian supply chains)"
  },
  "tripwires": {
    "intro": "Three revision conditions. Gross margin recovery is the most important. Revenue deceleration would simultaneously challenge T1 and T3, while tariff escalation would directly trigger T4.",
    "cards": [
      {
        "date": "FEBRUARY 2027",
        "name": "1H FY27 Gross Margin Recovery Test",
        "conditions": [
          {
            "if": "If 1H FY27 gross margin is reported at 37.0%+ (recovering toward pre-tariff levels)",
            "valence": "positive",
            "then": "T1 confirmed. Pricing actions and supply chain diversification are working. T4 structurally weakens. Premium multiple justified — potential re-rating toward A$38-40."
          },
          {
            "if": "If 1H FY27 gross margin remains at or below 35.5%",
            "valence": "negative",
            "then": "T4 confirmed as structural. The market has been waiting for margin recovery that is not materialising. P/E compression likely — stock could de-rate from 35x toward 25-28x, implying A$24-27."
          }
        ],
        "source": "Source: Breville 1H FY27 Half-Year Results (expected February 2027); ASX Announcement"
      },
      {
        "date": "AUGUST 2026",
        "name": "FY26 Full-Year EBIT vs Guidance",
        "conditions": [
          {
            "if": "If FY26 EBIT exceeds A$208M (slight increase on FY25 A$204.6M, with margin recovery evidenced in H2)",
            "valence": "positive",
            "then": "T1 confirms — revenue growth and pricing actions flowing through. T4 tail risk recedes. Market narrative: 'BRG is managing the tariff headwind better than feared'."
          },
          {
            "if": "If FY26 EBIT disappoints below A$195M or guidance is downgraded mid-year",
            "valence": "negative",
            "then": "T3 or T4 elevated. Combined revenue and margin pressure. Stock de-rates toward A$27-30. Management credibility at risk."
          }
        ],
        "source": "Source: Breville FY26 Full-Year Results; ASX Announcement August 2026"
      },
      {
        "date": "ONGOING — TRADE POLICY",
        "name": "US Tariff Policy Development",
        "conditions": [
          {
            "if": "If US announces tariff reduction or consumer goods exemption programme affecting BRG's product categories",
            "valence": "positive",
            "then": "T4 eliminated. Cost structure improves materially without requiring pricing action or supply chain disruption. Gross margin could recover to 37.5%+. Stock re-rates toward A$38-40."
          },
          {
            "if": "If US tariffs on Vietnamese goods escalate to 25%+ (current ~10-15%)",
            "valence": "negative",
            "then": "T4 becomes the central thesis. BRG's supply chain diversification strategy is undermined. Gross margins face additional 200-300bps compression. Stock de-rates to A$25-28."
          }
        ],
        "source": "Source: US USTR tariff announcements; USCBP rulings; Breville ASX disclosures on supply chain"
      }
    ]
  },
  "gaps": {
    "coverageRows": [
      {
        "domain": "Corporate Comms",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "1H FY26 Results (Feb 2026)",
        "confidence": "Low (motivated on tariff recovery timeline)",
        "confidenceClass": ""
      },
      {
        "domain": "Financial Statements",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "1H FY26",
        "confidence": "High (audited; margin compression confirmed)",
        "confidenceClass": "td-green"
      },
      {
        "domain": "Broker Research",
        "coverageLevel": "good",
        "coverageLabel": "Good",
        "freshness": "Post-results (Feb 2026)",
        "confidence": "Medium (consensus may lag structural tariff risk)",
        "confidenceClass": "td-amber"
      },
      {
        "domain": "Competitor Data",
        "coverageLevel": "good",
        "coverageLabel": "Good",
        "freshness": "2025 results",
        "confidence": "High (De'Longhi independent)",
        "confidenceClass": "td-green"
      },
      {
        "domain": "Economic Data",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "Current (Feb 2026)",
        "confidence": "High (objective)",
        "confidenceClass": "td-green"
      },
      {
        "domain": "Alternative Data",
        "coverageLevel": "good",
        "coverageLabel": "Good",
        "freshness": "Current",
        "confidence": "Medium (demand proxies, not forward-looking)",
        "confidenceClass": "td-amber"
      },
      {
        "domain": "Academic Research",
        "coverageLevel": "good",
        "coverageLabel": "Good",
        "freshness": "Structural",
        "confidence": "High (peer-reviewed)",
        "confidenceClass": "td-green"
      },
      {
        "domain": "Media &amp; Social",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "Feb 2026",
        "confidence": "Low (noise)",
        "confidenceClass": ""
      },
      {
        "domain": "Leadership &amp; Governance",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "Current",
        "confidence": "High (clean governance record)",
        "confidenceClass": "td-green"
      },
      {
        "domain": "Ownership &amp; Capital Flows",
        "coverageLevel": "full",
        "coverageLabel": "Full",
        "freshness": "Current",
        "confidence": "High (ASX filings)",
        "confidenceClass": "td-green"
      }
    ],
    "couldntAssess": [
      "<strong>Sage Europe revenue and margin:</strong> Breville does not separately disclose Sage European revenues or margins. The scale and profitability of the European business is the single most important undisclosed variable in the investment case.",
      "<strong>Supply chain diversification progress:</strong> The exact proportion of production currently sourced from Vietnam vs China, and the timeline to reach target ratios, is not publicly disclosed. This is the key operational variable for the tariff offset strategy.",
      "<strong>Price elasticity at current tariff-elevated prices:</strong> Whether Breville's recent price increases are holding volume or causing some trade-down in lower-tier SKUs is not directly observable from reported revenue figures.",
      "<strong>US tariff policy trajectory:</strong> Inherently unknowable — the most important exogenous variable cannot be assessed."
    ],
    "analyticalLimitations": "Hypothesis survival scores (T1: 40%, T2: 30%, T3: 35%, T4: 20%) reflect current evidence weighting. T1 scores highest because consistent revenue growth is confirmed and management credibility on delivery is strong. T3 scores 35% — elevated relative to its 'low-probability' feel — because the combination of tariff headwinds and consumer discretionary uncertainty creates a genuine dual downside scenario. T4 scores 20% because the market has not yet seen sustained margin compression (1H FY26 is the first clear evidence). If 1H FY27 also shows compressed margins, T4 would be upgraded significantly."
  },
  "technicalAnalysis": {
    "date": "20 February 2026",
    "period": "1 Year",
    "source": "Continuum Technical Intelligence",
    "regime": "Recovery",
    "clarity": "Moderate",
    "price": {
      "current": 32.95,
      "currency": "A$"
    },
    "movingAverages": {
      "ma50": {
        "value": 32.1,
        "date": "20 Feb 2026"
      },
      "ma200": {
        "value": 30.85,
        "date": "20 Feb 2026"
      },
      "crossover": null,
      "priceVsMa50": 2.6,
      "priceVsMa200": 6.8
    },
    "trend": {
      "direction": "Up",
      "duration": "6 months",
      "structure": "Recovery from 52-week low A$24.33 (tariff fears). Peaked at A$37.11 in mid-2025 before de-rating. Currently trading in the middle of the 12-month range — neither at extremes.",
      "peak": {
        "price": 37.11,
        "date": "w/c 5 May 2025"
      },
      "trough": {
        "price": 24.33,
        "date": "w/c 4 August 2025"
      },
      "drawdown": -11
    },
    "keyLevels": {
      "support": {
        "price": 30.5,
        "method": "200-day MA and prior consolidation zone"
      },
      "resistance": {
        "price": 37.11,
        "method": "52-week high (May 2025)"
      },
      "fiftyTwoWeekHigh": {
        "price": 37.11,
        "date": "w/c 5 May 2025"
      },
      "fiftyTwoWeekLow": {
        "price": 24.33,
        "date": "w/c 4 August 2025"
      }
    },
    "volume": {
      "latestVs20DayAvg": 1.2,
      "latestDate": "20 February 2026",
      "priorSpikes": [
        {
          "period": "w/c 5 May 2025",
          "ratio": 2,
          "context": "52-week high; pre-tariff optimism peak"
        },
        {
          "period": "w/c 4 August 2025",
          "ratio": 2.4,
          "context": "52-week low; tariff impact fears accelerated sell-off"
        },
        {
          "period": "February 2026",
          "ratio": 1.8,
          "context": "1H FY26 results; revenue beat but margin concerns"
        }
      ]
    },
    "volatility": {
      "latestDailyRange": {
        "high": 33.5,
        "low": 32.2,
        "date": "20 February 2026"
      },
      "latestRangePercent": 4,
      "avgDailyRangePercent30": 1.4,
      "avgDailyRangePercent90": 1.6
    },
    "meanReversion": {
      "vsMa50": 2.6,
      "vsMa200": 6.8,
      "rangePosition": 68,
      "rangeHigh": 37.11,
      "rangeLow": 24.33
    },
    "inflectionPoints": [
      {
        "date": "w/c 5 May 2025",
        "price": 37.11,
        "event": "52-week high; premium multiple peak before tariff news"
      },
      {
        "date": "w/c 4 August 2025",
        "price": 24.33,
        "event": "52-week low; tariff escalation fears; steep de-rating"
      },
      {
        "date": "w/c 6 October 2025",
        "price": 28.55,
        "event": "Recovery begins; De'Longhi results positive for sector"
      },
      {
        "date": "w/c 12 January 2026",
        "price": 32.2,
        "event": "Approaches 50-day MA; pre-results recovery"
      },
      {
        "date": "February 2026",
        "price": 32.95,
        "event": "1H FY26 results: revenue +10.1%, margin compressed to 35.4%"
      }
    ],
    "relativePerformance": {
      "vsIndex": {
        "name": "S&amp;P/ASX 200",
        "period": "12 months",
        "stockReturn": -11.3,
        "indexReturn": -2.3,
        "relativeReturn": -9
      },
      "vsSector": {
        "name": "S&amp;P/ASX Consumer Discretionary",
        "period": "12 months",
        "stockReturn": -11.3,
        "sectorReturn": -5.8,
        "relativeReturn": -5.5
      }
    }
  },
  "footer": {
    "disclaimer": "This report does not constitute personal financial advice. Continuum Intelligence synthesises cross-domain evidence using the Analysis of Competing Hypotheses (ACH) methodology. All factual claims are sourced from ASX filings, company accounts, broker consensus data, and publicly available information. This report does not contain buy, sell, or hold recommendations, price targets, or valuation models.",
    "domainCount": "10 of 10",
    "hypothesesCount": "4 Active"
  }
}