{
  "ticker": "WOR",
  "tickerFull": "WOR.AX",
  "exchange": "ASX",
  "company": "Worley Limited",
  "sector": "Energy",
  "sectorSub": "Engineering &amp; Professional Services",
  "price": 11.71,
  "currency": "A$",
  "date": "27 February 2026",
  "reportId": "WOR-2026-001",
  "priceHistory": [
    17.5,
    17.2,
    16.8,
    16.5,
    16.2,
    15.8,
    15.5,
    15.2,
    14.8,
    14.5,
    14.2,
    13.8,
    13.5,
    13.2,
    12.8,
    12.5,
    12.2,
    11.8,
    11.5,
    11.2,
    10.8,
    10.5,
    10.2,
    10,
    10.2,
    10.5,
    10.8,
    11,
    11.2,
    11.5,
    11.8,
    12,
    12.2,
    12.5,
    12.8,
    13,
    13.2,
    13.5,
    13.8,
    14,
    13.8,
    13.5,
    13.2,
    13,
    12.8,
    12.5,
    12.2,
    12,
    11.8,
    11.5,
    11.2,
    11.5,
    11.8,
    12,
    12.2,
    12.5,
    12.8,
    13,
    13.2,
    13,
    12.8,
    12.5,
    12.2,
    12,
    12.2,
    12.5,
    12.8,
    13,
    12.8,
    12.5,
    12.2,
    12.5,
    12.8,
    12.85,
    11.71
  ],
  "heroDescription": "Global Engineering &amp; Professional Services &bull; ~35,000 Employees &bull; FY24: $10.2B Revenue",
  "heroCompanyDescription": "Worley Limited (ASX: WOR) is a global engineering, procurement, construction, and consulting (EPC&amp;C) company serving the energy, chemicals, and resources sectors. Formed from the 2019 merger of WorleyParsons and Jacobs ECR division, Worley now generates approximately 50% of revenue from sustainability-related projects (renewables, hydrogen, carbon capture, electrification) and 50% from traditional energy (LNG, upstream oil &amp; gas, downstream refining). The company operates across 48 countries and is positioning itself as the engineering partner for the energy transition.",
  "heroMetrics": [
    {
      "label": "Mkt Cap",
      "value": "A$6.7B",
      "colorClass": ""
    },
    {
      "label": "Fwd P/E",
      "value": "14.5x",
      "colorClass": ""
    },
    {
      "label": "Div Yield",
      "value": "3.9%",
      "colorClass": ""
    },
    {
      "label": "Backlog",
      "value": "$16.8B",
      "colorClass": "positive"
    },
    {
      "label": "Sust. Revenue",
      "value": "~50%",
      "colorClass": "positive"
    }
  ],
  "skew": {
    "direction": "upside",
    "rationale": "Worley has de-rated 35% from its 2024 highs due to project delays, margin pressure from the Jacobs integration tail, and concerns about energy transition spending pace. At ~14.5x forward P/E with a $16.8B backlog and 50% sustainability revenue mix, the stock appears to price in a cyclical downturn that may not materialise. The energy transition capex cycle is multi-decade, and Worley's positioning across both traditional and sustainability engineering provides optionality. Risk skew tilts upside from these depressed levels."
  },
  "verdict": {
    "text": "FY24 (June year-end) delivered revenue of $10.2B (up 8%), underlying EBITA of $720M (up 12%), and a record backlog of $16.8B. The sustainability revenue mix reached 49% (vs 36% in FY22), confirming the structural shift. However, EBITA margin of 7.1% remains below the 8-9% target, dragged by legacy fixed-price contracts and integration costs. Net debt of $2.1B (2.9x EBITDA) is elevated but declining. The stock has sold off 35% on concerns about margin trajectory and project delays in hydrogen/CCS segments. At current levels, the market is pricing in execution failure rather than the structural growth opportunity the backlog implies.",
    "borderColor": "var(--signal-green)",
    "scores": [
      {
        "label": "N1 Transition",
        "score": "5%",
        "scoreColor": "var(--signal-green)",
        "dirArrow": "&uarr;",
        "dirText": "Growing",
        "dirColor": "var(--signal-green)"
      },
      {
        "label": "N2 Traditional",
        "score": "33%",
        "scoreColor": "var(--signal-green)",
        "dirArrow": "&rarr;",
        "dirText": "Steady",
        "dirColor": "var(--signal-green)"
      },
      {
        "label": "N3 Margins",
        "score": "35%",
        "scoreColor": "var(--signal-red)",
        "dirArrow": "&uarr;",
        "dirText": "Persistent",
        "dirColor": "var(--signal-red)"
      },
      {
        "label": "N4 Cyclical",
        "score": "27%",
        "scoreColor": "var(--signal-amber)",
        "dirArrow": "&rarr;",
        "dirText": "Watching",
        "dirColor": "var(--signal-amber)"
      }
    ]
  },
  "featuredMetrics": [
    {
      "label": "Mkt Cap",
      "value": "A$6.7B",
      "color": ""
    },
    {
      "label": "Backlog",
      "value": "$16.8B",
      "color": "var(--signal-green)"
    },
    {
      "label": "EBITA Margin",
      "value": "7.1%",
      "color": "var(--signal-amber)"
    },
    {
      "label": "Sust. Mix",
      "value": "~50%",
      "color": "var(--signal-green)"
    }
  ],
  "featuredPriceColor": "var(--signal-green)",
  "featuredRationale": "De-rated 35% from highs on margin concerns, but record backlog and 50% sustainability revenue mix underpin structural growth thesis. If margins recover to 8%+, significant re-rating potential from current levels.",
  "identity": {
    "rows": [
      [
        [
          "Ticker",
          "WOR.AX",
          "td-mono"
        ],
        [
          "Exchange",
          "ASX",
          "td-mono"
        ]
      ],
      [
        [
          "Market Cap",
          "A$6.7B",
          "td-mono"
        ],
        [
          "Enterprise Value",
          "A$8.8B",
          "td-mono"
        ]
      ],
      [
        [
          "Share Price",
          "A$12.85",
          "td-mono"
        ],
        [
          "52-Week Range",
          "A$10.00 &ndash; A$17.50",
          "td-mono"
        ]
      ],
      [
        [
          "Forward P/E",
          "14.5x",
          "td-mono"
        ],
        [
          "Trailing P/E",
          "16.2x",
          "td-mono"
        ]
      ],
      [
        [
          "Dividend Yield",
          "3.9%",
          "td-mono"
        ],
        [
          "Payout Ratio",
          "55%",
          "td-mono"
        ]
      ],
      [
        [
          "EBITA Margin",
          "7.1%",
          "td-mono td-amber"
        ],
        [
          "Target Margin",
          "8-9%",
          "td-mono"
        ]
      ],
      [
        [
          "Net Debt",
          "$2.1B",
          "td-mono"
        ],
        [
          "Net Debt/EBITDA",
          "2.9x",
          "td-mono td-amber"
        ]
      ],
      [
        [
          "Backlog",
          "$16.8B",
          "td-mono td-green"
        ],
        [
          "Revenue",
          "$10.2B",
          "td-mono"
        ]
      ],
      [
        [
          "Sector",
          "Energy",
          ""
        ],
        [
          "Sub-Sector",
          "Engineering & Professional Services",
          ""
        ]
      ],
      [
        [
          "CEO",
          "Chris Ashton",
          ""
        ],
        [
          "Appointed",
          "2022",
          ""
        ]
      ],
      [
        [
          "Employees",
          "~35,000",
          "td-mono"
        ],
        [
          "Countries",
          "48",
          "td-mono"
        ]
      ]
    ],
    "overview": "Global engineering and professional services company operating across energy, chemicals, and resources sectors. The 2019 acquisition of Jacobs ECR division ($4.6B) doubled Worley's scale and added North American and European exposure. Sustainability-related revenue has grown from 25% (FY20) to 49% (FY24), reflecting deliberate portfolio rotation toward renewables, hydrogen, carbon capture, and electrification projects. FY24 revenue $10.2B (+8%), underlying EBITA $720M (7.1% margin), backlog $16.8B (record). Net debt $2.1B declining from peak of $3.2B post-acquisition. Stock has de-rated from $17.50 to $12.85 on margin concerns and project delays."
  },
  "hypotheses": [
    {
      "tier": "N1",
      "direction": "upside",
      "title": "Energy Transition Winner: Sustainability Revenue Grows to 60%+",
      "statusClass": "status-green",
      "statusText": "Growing",
      "score": "55%",
      "scoreWidth": "55%",
      "scoreMeta": "Moderate conviction &bull; Structural shift underway",
      "description": "Worley is positioning as the go-to engineering partner for the energy transition. Sustainability revenue has grown from 25% (FY20) to 49% (FY24) and management targets 60%+ by FY27. Key growth areas include hydrogen projects, carbon capture and storage (CCS), offshore wind, battery materials processing, and grid modernisation. If global energy transition capex accelerates to $4T+/year (IEA Net Zero pathway), Worley's backlog and revenue could grow 15-20% annually, driving a re-rating toward technology/infrastructure multiples.",
      "requires": [
        "Sustainability revenue exceeds 55% in FY25 and 60% in FY26",
        "New contract wins in hydrogen, CCS, and offshore wind accelerate",
        "IRA (US) and EU Green Deal funding remains intact post-elections",
        "EBITA margins on sustainability projects converge with traditional energy margins"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Revenue shift</strong>: Sustainability revenue grew from 25% to 49% in 4 years, with $8.5B sustainability backlog (51% of total)",
        "<strong>IEA capex growth</strong>: Global clean energy investment reached $1.8T in 2024, up 17% yoy. On track for $4T+ by 2030 under Net Zero pathway",
        "<strong>Contract wins</strong>: FY24 sustainability wins included: Saudi NEOM green hydrogen ($1.2B), Australian CCS FEED studies ($300M), US battery materials processing ($450M)",
        "<strong>Talent positioning</strong>: Worley has 8,500 sustainability-specialist engineers, largest dedicated pool among global EPC companies"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Project delays</strong>: Several hydrogen and CCS projects delayed 6-12 months as clients await final investment decisions. FY24 saw $600M of expected sustainability wins slip to FY25",
        "<strong>Political risk</strong>: US IRA subsidies under scrutiny. EU Green Deal implementation slower than legislated. Transition capex is policy-dependent",
        "<strong>Lower margins</strong>: Sustainability projects average 6.5% EBITA margin vs 8.0% for traditional energy, dragging blended margins"
      ]
    },
    {
      "tier": "N2",
      "direction": "upside",
      "title": "Traditional Energy Cash Cow: LNG and Upstream Sustain",
      "statusClass": "status-green",
      "statusText": "Steady",
      "score": "65%",
      "scoreWidth": "65%",
      "scoreMeta": "High conviction &bull; Cash generation proven",
      "description": "Traditional energy (LNG, upstream, downstream) still generates ~50% of Worley's revenue and contributes higher margins (8%+ EBITA vs 6.5% for sustainability). Global LNG investment is in a multi-year upcycle with $200B+ of projects in construction or FID pipeline. Middle East upstream spending is at record levels. If traditional energy spending sustains, this segment provides the cash flow foundation that funds the sustainability transition and supports the dividend.",
      "requires": [
        "LNG investment cycle continues through 2028+",
        "Middle East upstream capex remains above $100B/year",
        "Oil & gas companies maintain sustaining capex despite transition rhetoric",
        "Worley retains top-3 position in LNG engineering market share"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>LNG mega-cycle</strong>: $200B+ of LNG projects in construction globally: North West Shelf extension, Qatar NFE, US Gulf Coast expansions. Worley has roles on 60% of active LNG projects",
        "<strong>Middle East boom</strong>: Saudi Aramco capex $50B (2024), ADNOC $150B 5-year program, QatarEnergy NFE $30B. Worley has JV relationships across all three NOCs",
        "<strong>Margin contribution</strong>: Traditional energy EBITA margin 8.0% vs group average 7.1%. Traditional projects typically cost-plus or reimbursable, reducing fixed-price risk",
        "<strong>Brownfield sustaining</strong>: Even in transition scenarios, existing oil & gas infrastructure requires $300B+/year in sustaining capex through 2040 (IEA)"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Transition pressure</strong>: Some clients reducing upstream capex in favour of renewables. European IOCs (Shell, BP) cut traditional engineering budgets 10-15% in 2024",
        "<strong>ESG investor scrutiny</strong>: Traditional energy revenue may limit ESG fund inclusion and constrain investor base",
        "<strong>Cyclical risk</strong>: Oil prices below US$60/bbl would trigger capex cuts across the traditional portfolio"
      ]
    },
    {
      "tier": "N3",
      "direction": "downside",
      "title": "Margin Pressure: Integration Drag and Fixed-Price Exposure",
      "statusClass": "status-red",
      "statusText": "Persistent",
      "score": "60%",
      "scoreWidth": "60%",
      "scoreMeta": "Moderate conviction &bull; Margin gap not closing",
      "description": "Worley's EBITA margin of 7.1% remains below the 8-9% target set at the time of the Jacobs acquisition (2019). The gap is driven by: (1) legacy fixed-price contracts inherited from Jacobs that are margin-dilutive, (2) sustainability projects averaging lower margins due to competitive pricing, (3) overhead from maintaining operations across 48 countries, and (4) $150M+ annual integration costs that have persisted longer than guided. If margins cannot reach 8%+ by FY26, the market will increasingly question management's execution credibility.",
      "requires": [
        "EBITA margin remains below 7.5% in FY25",
        "Fixed-price contract losses continue (>$100M annual drag)",
        "Sustainability margin gap persists (6.5% vs 8% traditional)",
        "Integration costs do not decline to zero by FY26 as guided"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Margin miss</strong>: FY24 EBITA margin 7.1% vs 8-9% target. Margin has improved only 80bp in 3 years (from 6.3% in FY21), well below trajectory needed",
        "<strong>Fixed-price drag</strong>: Legacy Jacobs fixed-price contracts generated $120M losses in FY24. Remaining exposure ~$800M in backlog, running off through FY26",
        "<strong>Sustainability discount</strong>: Sustainability EBITA margin 6.5% vs traditional 8.0%. Competitive pressure in renewables engineering keeping margins low",
        "<strong>Overhead burden</strong>: SG&A as % of revenue at 4.2%, above peer average of 3.5%. 48-country footprint creates structural overhead"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Fixed-price run-off</strong>: 80% of legacy fixed-price contracts will be completed by FY26. New contracts are predominantly cost-plus or reimbursable, reducing margin risk",
        "<strong>Backlog quality</strong>: New backlog booked at average 8.2% EBITA margin, above current realised margin. As legacy contracts roll off, blended margin should converge upward",
        "<strong>Cost programs</strong>: $200M cost reduction program underway (digital tools, shared services, office consolidation). Management guides $100M annualised savings by FY26"
      ]
    },
    {
      "tier": "N4",
      "direction": "downside",
      "title": "Cyclical Downturn: Energy Capex Correction",
      "statusClass": "status-amber",
      "statusText": "Watching",
      "score": "35%",
      "scoreWidth": "35%",
      "scoreMeta": "Lower conviction &bull; Tail risk",
      "description": "Worley is fundamentally an engineering services company exposed to energy capital expenditure cycles. In past downturns (2014-2016, 2020), revenue fell 20-30% and margins compressed to near-zero. If a global recession triggers simultaneous cuts in both traditional energy and sustainability capex, Worley's $16.8B backlog could deflate rapidly as clients defer or cancel projects. The elevated net debt (2.9x EBITDA) amplifies the downside.",
      "requires": [
        "Global recession triggers oil price below US$50/bbl",
        "Government subsidies for clean energy are cut (IRA rollback, EU Green Deal pause)",
        "Backlog cancellations exceed $2B in any 12-month period",
        "Net debt/EBITDA rises above 3.5x, threatening covenants"
      ],
      "supportingLabel": "Supporting Evidence",
      "supporting": [
        "<strong>Historical precedent</strong>: Revenue fell 28% in FY16 (oil downturn) and 15% in FY20 (COVID). EBITA margin hit 2.8% in FY20. Engineering services are inherently cyclical",
        "<strong>Net Debt</strong>: $2.1B (2.9x EBITDA) provides limited buffer in a downturn. Covenant test at 3.5x. Refinancing risk if EBITA declines 20%+",
        "<strong>Backlog vulnerability</strong>: $16.8B backlog includes pre-FID studies and early-stage FEED work that can be paused or cancelled without penalty",
        "<strong>IRA uncertainty</strong>: $3B of sustainability backlog is linked to US IRA-subsidised projects. Policy reversal would trigger cancellations"
      ],
      "contradictingLabel": "Contradicting Evidence",
      "contradicting": [
        "<strong>Diversification buffer</strong>: 50/50 traditional/sustainability mix provides natural hedge: if oil crashes, clean energy spending typically accelerates",
        "<strong>Geographic spread</strong>: Revenue across 48 countries reduces single-market concentration. Middle East spending is counter-cyclical to Western markets",
        "<strong>Sustaining capex base</strong>: ~40% of Worley's revenue is sustaining/maintenance work on existing facilities, which is more resilient than new-build capex"
      ]
    }
  ],
  "narrative": {
    "theNarrative": "Worley is caught between a structural growth opportunity and a cyclical market de-rating. The bull case: the energy transition is a multi-decade capex super-cycle, Worley is the best-positioned global engineering firm (50% sustainability revenue, $8.5B sustainability backlog, 8,500 specialist engineers), and the 35% sell-off has created a compelling entry point at 14.5x forward P/E. The bear case: margins have persistently disappointed (7.1% vs 8-9% target), the Jacobs integration has taken longer than expected, sustainability project margins are structurally lower than traditional energy, and net debt/EBITDA at 2.9x leaves limited buffer for a downturn. The stock is a margin story: if Worley can demonstrate 8%+ margins by FY26, the re-rating could be 30-40%. If margins stall at 7%, the stock will continue to de-rate.",
    "priceImplication": {
      "label": "Upside Skew from Depressed Levels",
      "content": "At $12.85, Worley is priced for margin stagnation in a de-rating scenario. Bull case (8.5% margin, 18x P/E): ~$19.00 (48% upside). Base case (7.5% margin, 15x P/E): ~$14.50 (13% upside). Bear case (6.5% margin, 10x P/E, downturn): ~$8.00 (38% downside). Risk/reward is asymmetric to the upside if margins recover, but downside is severe if a cyclical downturn materialises."
    },
    "evidenceCheck": "Evidence across 10 domains confirms the structural opportunity is real but execution is lagging. Corporate communications focus on sustainability growth, which is genuine but mask margin challenges. Statutory filings reveal the fixed-price contract drag. Broker consensus is cautiously bullish but conditioned on margin improvement. Academic research validates the multi-decade energy transition capex thesis. Alternative data shows strong engineering labour demand. The key risk is that the sustainability margin gap (6.5% vs 8%) is structural rather than transitional.",
    "narrativeStability": "Low-to-moderate: Worley's narrative is in flux. The company is transitioning from traditional energy services firm to energy transition leader, but the market is losing patience with the margin trajectory. Each quarterly result is a narrative-defining event. A single strong margin print could trigger a sharp re-rating; a miss would deepen the de-rating."
  },
  "evidence": {
    "intro": "Cross-referencing 10 independent evidence domains to validate or challenge each hypothesis. Worley's positioning at the intersection of traditional energy and sustainability engineering creates complex evidence dynamics across domains.",
    "cards": [
      {
        "number": 1,
        "title": "1. Corporate Communications",
        "epistemicClass": "ep-motivated",
        "epistemicLabel": "Motivated",
        "finding": "Worley investor presentations heavily emphasise the sustainability growth narrative, framing the company as \"the bridge between the energy of today and the energy of tomorrow.\" FY24 results highlighted record backlog, 49% sustainability mix, and key contract wins in hydrogen and CCS. <ul><li><strong>FY24 Results (Aug 2024):</strong> Revenue $10.2B (+8%). Underlying EBITA $720M (+12%). Backlog $16.8B (record). Sustainability revenue 49% (up from 42% in FY23). CEO Ashton: &ldquo;We are uniquely positioned to serve both the energy of today and the energy transition&rdquo;</li><li><strong>Margin guidance:</strong> Management reiterated 8-9% EBITA margin target by FY26. Acknowledged FY24 margin of 7.1% is &ldquo;below our ambition&rdquo; but attributed to legacy fixed-price contract losses ($120M) that are running off</li><li><strong>Capital Markets Day (Nov 2024):</strong> Targeted $12B+ revenue by FY27. Sustainability mix target 60%+. Announced $200M cost reduction program. Guided net debt/EBITDA to 2.0x by FY26</li><li><strong>Dividend:</strong> Maintained $0.50/share (55% payout). Signalled no increase until net debt/EBITDA below 2.5x, prioritising debt reduction</li></ul>",
        "tension": "Confirms N1 (sustainability growth is real) and N2 (traditional energy remains material). Corporate framing naturally emphasises growth over margin challenges. The 8-9% margin target has been reiterated for 3 years without achievement, reducing credibility. Discount timeline claims by 30-40%.",
        "table": null,
        "tags": [
          {
            "text": "Supports N1 (sustainability growth is real)",
            "class": "supports"
          },
          {
            "text": "Supports N2 (traditional energy remains material)",
            "class": "supports"
          }
        ],
        "source": "FY24 Results (Aug 2024); Margin guidance; Capital Markets Day (Nov 2024); Dividend"
      },
      {
        "number": 2,
        "title": "2. Regulatory Filings &amp; Financial Statements",
        "epistemicClass": "ep-statutory",
        "epistemicLabel": "Audited / Statutory",
        "finding": "Audited FY24 financials reveal the margin composition challenge. Segment reporting shows traditional energy margins at 8.0% vs sustainability at 6.5%. Goodwill from Jacobs acquisition ($3.8B) requires assumptions that are increasingly stretched at lower share prices. <ul><li><strong>Segment reporting (audited):</strong> Americas revenue $3.8B (EBITA 7.2%). EMEA $2.8B (6.8%). APAC $2.4B (7.5%). Integrated Energy $1.2B (6.5%). Group EBITA $720M (7.1%)</li><li><strong>Fixed-price contract losses:</strong> Note 4 discloses $120M losses on legacy fixed-price contracts in FY24. Remaining fixed-price backlog ~$800M (5% of total), expected to complete by FY26. No new fixed-price contracts being taken</li><li><strong>Goodwill and intangibles:</strong> Goodwill $3.8B (56% of equity). Customer relationships $1.2B. Impairment testing uses WACC 10.5% and terminal growth 2.5%. At current share price, market cap ($6.7B) barely covers goodwill + net debt ($5.9B), implying market values the operating business near zero</li><li><strong>Debt profile:</strong> Gross debt $3.3B. Net debt $2.1B. Average maturity 3.8 years. Interest cover 4.2x. First major maturity $800M in Nov 2026 (syndicated facility)</li></ul>",
        "tension": "Statutory data directly confirms N3 (margin gap between sustainability and traditional is real and documented in segment reporting). Goodwill impairment risk increases N4 downside severity. Fixed-price contract run-off provides a clear path to margin improvement, supporting the recovery thesis.",
        "table": null,
        "tags": [
          {
            "text": "Supports N3 (margin gap between sustainability and traditional is real and documented in segment reporting)",
            "class": "supports"
          }
        ],
        "source": "Segment reporting (audited); Fixed-price contract losses; Goodwill and intangibles; Debt profile"
      },
      {
        "number": 3,
        "title": "3. Broker Research",
        "epistemicClass": "ep-consensus",
        "epistemicLabel": "Consensus",
        "finding": "Broker consensus is cautiously bullish: 8 Buy, 4 Hold, 1 Sell. Consensus 12-month target price of ~$16.00 implies 25% upside from current levels. All brokers acknowledge the margin challenge but differ on timing and probability of recovery. <ul><li><strong>Bullish camp (Macquarie, UBS, Citi):</strong> View de-rating as overdone. Expect margins to reach 8% by FY26 as fixed-price contracts roll off. Value sustainability backlog at premium. Target $17-19 based on 16-18x recovered earnings</li><li><strong>Cautious camp (Morgan Stanley, Ord Minnett):</strong> Acknowledge structural opportunity but concerned about margin delivery timing. Want to see 2 consecutive quarters of 8%+ margins before upgrading. Target $13-15</li><li><strong>Consensus forecasts:</strong> FY25E revenue $10.8B (+6%), EBITA $810M (7.5% margin). FY26E revenue $11.5B (+6%), EBITA $950M (8.3% margin). FY27E $12.2B, EBITA $1.05B (8.6%)</li><li><strong>Key condition:</strong> Every Buy-rated broker explicitly conditions their target on margin improvement. If FY25 margin is below 7.5%, consensus downgrades are likely</li></ul>",
        "tension": "Broker consensus supports the upside thesis at current levels (25% upside to consensus target) but is explicitly conditioned on N3 (margin recovery). The FY26 margin forecast of 8.3% is the key assumption — if achieved, re-rating is likely; if missed, further de-rating.",
        "table": null,
        "tags": [
          {
            "text": "Supports N3 (margin recovery)",
            "class": "supports"
          }
        ],
        "source": "Bullish camp (Macquarie, UBS, Citi); Cautious camp (Morgan Stanley, Ord Minnett); Consensus forecasts; Key condition"
      },
      {
        "number": 4,
        "title": "4. Competitor Disclosures",
        "epistemicClass": "ep-independent",
        "epistemicLabel": "Independent",
        "finding": "Peer engineering companies (Fluor, TechnipFMC, Wood Group, Aker Solutions) provide independent validation of industry trends. Margins are generally improving across the sector as legacy fixed-price work completes. Sustainability engineering is a shared growth theme but competitive intensity is increasing. <ul><li><strong>Fluor (US):</strong> FY24 revenue $16.3B. Adjusted EBITDA margin 5.8% (up from 4.2%). Backlog $32B. Similar margin recovery story — legacy fixed-price contracts causing drag. Sustainability segment growing but lower margin. Trading at 18x forward P/E</li><li><strong>TechnipFMC:</strong> Revenue $8.5B. Adjusted EBITDA margin 14.2% (higher due to equipment/subsea mix). Offshore wind and hydrogen growing but from smaller base. Subsea orders at record levels</li><li><strong>Wood Group (UK):</strong> Rejected takeover bid at 230p. Revenue $5.8B. EBITA margin 4.5% (weakest among peers). Major restructuring underway. Validates that engineering services margins are cyclically depressed</li><li><strong>Aker Solutions (Norway):</strong> Revenue $5.2B. EBITDA margin 9.5%. Higher margin due to subsea/offshore focus. Sustainability revenue 25% (lower than Worley). Positioned more as traditional energy specialist</li></ul>",
        "tension": "Peer margins confirm that Worley\\'s 7.1% is mid-range for the sector and that margin recovery from fixed-price drag is achievable (Fluor improving, Aker at 9.5%). Competitive intensity in sustainability engineering is increasing (all peers expanding), which may limit Worley\\'s margin upside in that segment (supporting N3).",
        "table": null,
        "tags": [
          {
            "text": "Contextual — informs overall assessment",
            "class": "neutral"
          }
        ],
        "source": "Fluor (US); TechnipFMC; Wood Group (UK); Aker Solutions (Norway)"
      },
      {
        "number": 5,
        "title": "5. Economic Data",
        "epistemicClass": "ep-objective",
        "epistemicLabel": "Objective",
        "finding": "Global energy capital expenditure data from IEA, oil & gas industry capex surveys, and renewable energy investment tracking provide the macro demand backdrop. Both traditional and clean energy capex are growing, supporting Worley\\'s dual-exposure positioning. <ul><li><strong>IEA World Energy Investment (2024):</strong> Global energy investment $2.8T. Clean energy $1.8T (+17% yoy). Fossil fuels $1.0T (+2%). Clean energy now exceeds fossil fuel investment for first time. IEA projects $4T+ clean energy by 2030 in Net Zero scenario</li><li><strong>Oil & gas upstream capex (Rystad):</strong> Global upstream capex $580B in 2024 (+8%). Middle East $140B (record). North America $180B. Sustaining capex (brownfield/maintenance) $220B (+5%)</li><li><strong>Hydrogen pipeline (BNEF):</strong> Global green hydrogen project pipeline $320B. Only $40B reached FID. FID rate slowing due to subsidy uncertainty and electrolyser cost delays. Potential risk to Worley hydrogen backlog</li><li><strong>Engineering labour market (ABS/BLS):</strong> Engineering labour shortage across Australia, US, UK. Graduate engineer salaries up 8-12% in 2024. Labour cost inflation is a sector-wide headwind but also a moat for incumbents with established talent pools</li></ul>",
        "tension": "Economic data strongly supports N1 (clean energy investment growing 17% yoy) and N2 (traditional energy capex also growing). However, hydrogen FID slowdown is a near-term risk to N1 sustainability backlog conversion. Labour cost inflation is a double-edged sword: supports pricing power but pressures margins (N3).",
        "table": null,
        "tags": [
          {
            "text": "Strongly Supports N1 (clean energy investment growing 17% yoy)",
            "class": "strong"
          },
          {
            "text": "Supports N2 (traditional energy capex also growing)",
            "class": "supports"
          }
        ],
        "source": "IEA World Energy Investment (2024); Oil & gas upstream capex (Rystad); Hydrogen pipeline (BNEF); Engineering labour market (ABS/BLS)"
      },
      {
        "number": 6,
        "title": "6. Alternative Data",
        "epistemicClass": "ep-behavioural",
        "epistemicLabel": "Behavioural",
        "finding": "Engineering job postings, LinkedIn hiring data, and project tracking databases provide real-time signals on Worley\\'s activity levels and competitive positioning. Data shows continued hiring despite share price weakness, suggesting management confidence in backlog conversion. <ul><li><strong>LinkedIn job postings (Feb 2025):</strong> Worley has 680 open roles globally. 45% in sustainability-related positions (hydrogen engineers, CCS specialists, offshore wind). 30% traditional energy. 25% corporate/digital. Net headcount growth of 1,200 in H1 FY25 (to ~35,000)</li><li><strong>ICIS project tracker:</strong> Worley is listed as engineering partner on 47 active energy transition projects globally (vs 38 in Jan 2024). New additions include 3 hydrogen projects in Saudi Arabia, 2 CCS projects in Australia, and 4 battery materials projects in North America</li><li><strong>Glassdoor (Feb 2025):</strong> Overall rating 3.4/5. CEO Chris Ashton approval 65%. Culture criticism centres on post-merger integration fatigue and &ldquo;too many reorganisations.&rdquo; Engineering roles rated higher (3.7/5) than corporate (3.0/5)</li><li><strong>Google Trends &ldquo;Worley careers&rdquo;:</strong> Search interest up 25% yoy in Australia, 15% in US, 35% in Middle East. Rising interest suggests strong employer brand despite share price decline</li></ul>",
        "tension": "Alternative data supports N1 and N2 (continued hiring and project wins indicate operational momentum). The Glassdoor integration fatigue signal is relevant to N3 (cultural drag on margin improvement). Rising career search interest suggests Worley is winning the talent war, which is critical for a people-intensive business.",
        "table": null,
        "tags": [
          {
            "text": "Supports N2 (continued hiring and project wins indicate operational momentum)",
            "class": "supports"
          },
          {
            "text": "Supports N3 (cultural drag on margin improvement)",
            "class": "supports"
          }
        ],
        "source": "LinkedIn job postings (Feb 2025); ICIS project tracker; Glassdoor (Feb 2025); Google Trends &ldquo;Worley careers&rdquo;"
      },
      {
        "number": 7,
        "title": "7. Academic Research",
        "epistemicClass": "ep-peerreviewed",
        "epistemicLabel": "Peer-Reviewed",
        "finding": "Academic literature on energy transition investment, engineering services economics, and post-merger integration provides structural context. Research confirms the multi-decade nature of the energy transition capex cycle but highlights that engineering margin improvement post-M&A typically takes 4-6 years. <ul><li><strong>IEA / IRENA (2024), &ldquo;World Energy Transitions Outlook&rdquo;:</strong> Estimates cumulative energy transition investment of $150T needed by 2050, averaging $5T/year. Engineering and construction services estimated at 15-20% of total ($750B-$1T/year). Supports multi-decade growth thesis for N1</li><li><strong>Deloitte (2024), &ldquo;Engineering Services M&A: Post-Merger Value Creation&rdquo;:</strong> Analysis of 35 engineering sector mergers (2010-2022) shows average time to margin recovery is 4.5 years post-close. 60% of deals achieve target margins within 5 years. Worley/Jacobs at 5 years and counting, in the slower cohort</li><li><strong>Farmer &amp; Lafond (2023), &ldquo;Learning Curves in Clean Energy Technologies&rdquo;:</strong> Demonstrates that engineering costs for clean energy projects decline 15-20% with each doubling of installed capacity. Implies Worley\\'s sustainability margins should improve over time as project standardisation increases</li></ul>",
        "tension": "Academic evidence strongly supports N1 (multi-decade capex cycle is structurally sound) and provides a framework for N3 (post-merger margin recovery is achievable but Worley is behind the typical timeline). Learning curve research suggests sustainability margins will improve but gradually, not immediately.",
        "table": null,
        "tags": [
          {
            "text": "Strongly Supports N1 (multi-decade capex cycle is structurally sound)",
            "class": "strong"
          },
          {
            "text": "Supports N3 (post-merger margin recovery is achievable but Worley is behind the typical timeline)",
            "class": "supports"
          }
        ],
        "source": "IEA / IRENA (2024), &ldquo;World Energy Transitions Outlook&rdquo;; Deloitte (2024), &ldquo;Engineering Services M&A: Post-Merger Value Creation&rdquo;; Farmer &amp; Lafond (2023), &ldquo;Learning Curves in Clean Energy Technologies&rdquo;"
      },
      {
        "number": 8,
        "title": "8. Media &amp; Social",
        "epistemicClass": "ep-noise",
        "epistemicLabel": "Noise",
        "finding": "Financial media coverage is dominated by the margin disappointment narrative and share price decline. Social media sentiment is negative, with investors frustrated by the gap between the energy transition growth story and delivered financial performance. <ul><li><strong>AFR/Business press (30 days):</strong> 6 articles mentioning Worley. Dominant themes: margin disappointment (3), energy transition opportunity (2), debt concerns (1). Tone: cautiously negative. One contrarian piece calling Worley &ldquo;the most underappreciated energy transition play on the ASX&rdquo;</li><li><strong>Hot Copper WOR thread:</strong> 1,800 followers. Sentiment heavily negative: top-rated posts criticise management for &ldquo;over-promising and under-delivering on margins&rdquo; and &ldquo;destroying value with the Jacobs deal.&rdquo; Long-term holders expressing fatigue</li><li><strong>Twitter/X #Worley:</strong> 45 posts in 7 days. 60% negative (margin/price decline), 25% neutral, 15% positive (transition opportunity). Institutional commentary more constructive than retail</li><li><strong>Livewire fund managers:</strong> 3 of 12 surveyed hold Worley. 2 initiated positions in past 6 months (&ldquo;buying the capitulation&rdquo;), 1 reducing. Value managers more interested than growth managers</li></ul>",
        "tension": "Negative media sentiment is a contrarian indicator at extreme levels. The investor fatigue and capitulation-like selling pattern historically marks bottoming processes in cyclical stocks. However, sentiment alone is not a buy signal — margin delivery is required to validate the contrarian thesis.",
        "table": null,
        "tags": [
          {
            "text": "Contextual — informs overall assessment",
            "class": "neutral"
          }
        ],
        "source": "AFR/Business press (30 days); Hot Copper WOR thread; Twitter/X #Worley; Livewire fund managers"
      },
      {
        "number": 9,
        "title": "9. Leadership &amp; Governance",
        "epistemicClass": "ep-governance",
        "epistemicLabel": "Independent Assessment",
        "finding": "CEO Chris Ashton (appointed Oct 2022) inherited the Jacobs integration challenge and is driving the sustainability pivot. Board composition includes engineering, energy, and ESG expertise. Governance ratings are adequate but not outstanding. <ul><li><strong>CEO Chris Ashton:</strong> Former COO of Viva Energy and ex-BP executive (20+ years). Appointed Oct 2022 following Andrew Wood retirement. Has refocused strategy on margin recovery, debt reduction, and sustainability growth. Initiated $200M cost reduction program. Compensation: $4.2M total (FY24), 55% at-risk</li><li><strong>Board composition:</strong> 8 directors, 7 independent. Chairman: John Grill (founder, non-executive since 2012). Skills: 8/8 energy, 6/8 engineering, 5/8 finance, 3/8 sustainability. Average tenure 5.8 years. 38% female. Grill\\'s continued involvement provides continuity but raises independence questions</li><li><strong>Governance ratings:</strong> ISS Quality Score: 4/10 (average). MSCI ESG Rating: A. Sustainalytics: Low Risk (19.8). No material governance controversies since 2020</li><li><strong>Key risk:</strong> John Grill\\'s 7.2% shareholding and board presence creates potential governance overhang. Founder influence can be positive (strategic continuity) or negative (resistance to change)</li></ul>",
        "tension": "Ashton\\'s operational background (COO experience, BP cost discipline) is well-suited to N3 (margin recovery). Grill\\'s continued involvement is a double-edged sword. Governance is adequate but not a differentiator. Board lacks deep sustainability/clean energy expertise relative to the strategic pivot.",
        "table": null,
        "tags": [
          {
            "text": "Supports N3 (margin recovery)",
            "class": "supports"
          }
        ],
        "source": "CEO Chris Ashton; Board composition; Governance ratings; Key risk"
      },
      {
        "number": 10,
        "title": "10. Ownership &amp; Capital Flows",
        "epistemicClass": "ep-registry",
        "epistemicLabel": "Registry Data",
        "finding": "Worley\\'s shareholder register has shifted significantly: value and contrarian funds have been buying the de-rating while momentum and growth funds have been selling. Founder John Grill remains the largest individual holder. Short interest is elevated at 3.8%. <ul><li><strong>Substantial holders (ASX, Feb 2025):</strong> John Grill 7.2% (founder), Vanguard 4.5%, Perpetual 4.1%, BlackRock 3.8%. Perpetual (value investor) increased position by 1.2% in H2 2024: bullish signal from active value manager</li><li><strong>Short interest:</strong> 3.8% of shares outstanding (up from 1.5% in Jan 2024). Highest short interest in 5 years. Shorts are betting on continued margin disappointment and potential earnings miss</li><li><strong>Institutional positioning:</strong> Average active fund holds 0.3% WOR (vs ~0.4% index weight, slightly underweight). ESG-focused funds overweight due to sustainability revenue mix. Traditional energy funds underweight due to transition pivot</li><li><strong>Insider transactions:</strong> CEO Ashton purchased $500K on-market at $11.80 in Nov 2024. CFO purchased $200K at $12.20. Insider buying at depressed levels is typically a positive signal</li></ul>",
        "tension": "Registry data reveals a classic capitulation pattern: momentum sellers exiting, value buyers entering, insiders buying, shorts building. This pattern historically precedes bottoming in cyclical stocks but requires a catalyst (margin improvement) to resolve. Perpetual\\'s increased position and insider buying are meaningful positive signals.",
        "table": null,
        "tags": [
          {
            "text": "Contextual — informs overall assessment",
            "class": "neutral"
          }
        ],
        "source": "Substantial holders (ASX, Feb 2025); Short interest; Institutional positioning; Insider transactions"
      }
    ],
    "alignmentSummary": null
  },
  "discriminators": {
    "intro": "Identifying the evidence that most strongly differentiates between bull and bear outcomes for Worley. The structural opportunity is well-understood; the discriminators centre on margin execution and backlog conversion quality.",
    "rows": [
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "The single most important variable. If FY25 margin exceeds 7.5% and FY26 reaches 8%+, the de-rating reverses. Fixed-price contract run-off ($800M remaining) provides a clear mathematical path to improvement. New backlog at 8.2% margin supports convergence. Monitor each quarterly margin disclosure.",
        "discriminatesBetween": "EBITA Margin Trajectory",
        "currentReading": "Leans Bull",
        "readingClass": "td-green"
      },
      {
        "diagnosticity": "MEDIUM",
        "diagnosticityClass": "disc-medium",
        "evidence": "$8.5B sustainability backlog looks impressive but conversion to revenue depends on client FID decisions, government subsidy frameworks, and project financing availability. If hydrogen/CCS FID rates accelerate (supported by IRA/EU Green Deal), N1 strengthens. If FID delays persist, backlog quality is questioned.",
        "discriminatesBetween": "Sustainability Backlog Conversion Rate",
        "currentReading": "Neutral",
        "readingClass": "td-amber"
      },
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "Net debt falling from $2.1B toward $1.5B (guided by FY26) would de-risk the balance sheet, improve interest cover, and unlock capacity for dividend increase or buyback. Debt reduction demonstrates cash conversion quality and operational discipline. Failure to reduce net debt would increase N4 vulnerability.",
        "discriminatesBetween": "Net Debt Reduction Pace",
        "currentReading": "Leans Bull",
        "readingClass": "td-green"
      },
      {
        "diagnosticity": "HIGH",
        "diagnosticityClass": "disc-high",
        "evidence": "CEO and CFO both purchased shares on-market at prices near current levels ($11.80 and $12.20 respectively). Insider buying in size during a de-rating is historically a strong positive signal, as management has the most information about near-term margin trajectory. If more insiders buy, conviction in recovery increases.",
        "discriminatesBetween": "Insider Buying Pattern",
        "currentReading": "Leans Bull",
        "readingClass": "td-green"
      }
    ],
    "nonDiscriminating": "The energy transition structural thesis is well-established and does not discriminate between near-term outcomes. Worley will continue to win sustainability contracts regardless of whether margins improve. Similarly, traditional energy demand will sustain regardless of Worley-specific factors. The discriminators are all about execution and margin delivery."
  },
  "tripwires": {
    "intro": "Monitoring signals that would trigger reassessment of the investment thesis for Worley.",
    "cards": [
      {
        "date": "MONITORING",
        "name": "FY25 EBITA Margin Below 7.0%",
        "conditions": [
          {
            "if": "FY25 EBITA Margin Below 7.0%",
            "valence": "neutral",
            "then": "If FY25 EBITA margin fails to improve from FY24's 7.1%, the margin recovery thesis is invalidated. Would trigger consensus downgrades, increase N3 conviction to 80%+, and likely push the stock to new lows. This is the most important single data point."
          }
        ],
        "source": "Continuum analysis"
      },
      {
        "date": "NOT TRIGGERED",
        "name": "Backlog Decline Below $15B",
        "conditions": [
          {
            "if": "Backlog Decline Below $15B",
            "valence": "positive",
            "then": "Record backlog of $16.8B is a key support for the growth thesis. If backlog declines below $15B due to project cancellations, deferrals, or competitive losses, the revenue pipeline weakens and N1/N2 conviction declines. Monitor quarterly order intake disclosures."
          }
        ],
        "source": "Continuum analysis"
      },
      {
        "date": "MONITORING",
        "name": "Net Debt/EBITDA Rises Above 3.5x",
        "conditions": [
          {
            "if": "Net Debt/EBITDA Rises Above 3.5x",
            "valence": "neutral",
            "then": "Net debt/EBITDA at 2.9x is manageable but leaves limited headroom to the 3.5x covenant test level. If net debt/EBITDA rises (EBITA decline or working capital blow-out), financial risk escalates rapidly. A covenant breach would force emergency equity raising."
          }
        ],
        "source": "Continuum analysis"
      },
      {
        "date": "MONITORING",
        "name": "US IRA Subsidy Rollback",
        "conditions": [
          {
            "if": "US IRA Subsidy Rollback",
            "valence": "neutral",
            "then": "Approximately $3B of sustainability backlog is linked to US IRA-subsidised clean energy projects. Significant rollback of IRA provisions (hydrogen production tax credit, CCS 45Q credits) would trigger project cancellations and reduce the addressable market for sustainability engineering."
          }
        ],
        "source": "Continuum analysis"
      }
    ]
  },
  "gaps": {
    "coverageRows": [
      {
        "domain": "Corporate Communications",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Regulatory Filings",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Broker Research",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Competitor Disclosures",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Economic Data",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Alternative Data",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Academic Research",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Media & Social",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Leadership & Governance",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      },
      {
        "domain": "Ownership & Capital Flows",
        "coverageLevel": "moderate",
        "coverageLabel": "covered",
        "freshness": "Feb 2025",
        "confidence": "Medium",
        "confidenceClass": "conf-medium"
      }
    ],
    "couldntAssess": [
      "Worley internal project margin database by project type and geography (proprietary)",
      "Fixed-price contract loss provisioning details (disclosed in aggregate only)",
      "Client FID pipeline for sustainability projects (confidential commercial data)",
      "Jacobs integration cost breakdown and remaining synergy targets (internal)"
    ],
    "analyticalLimitations": "This analysis relies on publicly available financial data and industry estimates. Engineering project margins vary significantly by contract type, geography, and client, making aggregate margin forecasts inherently imprecise. Backlog conversion rates depend on client capital allocation decisions that are not predictable. Sustainability revenue classification may differ across companies, making peer comparisons approximate."
  },
  "technicalAnalysis": {
    "date": "14 February 2026",
    "period": "12 months",
    "source": "ASX / Yahoo Finance",
    "regime": "Downtrend — Bottoming Attempt",
    "clarity": "Low clarity, searching for base",
    "price": {
      "current": 12.85,
      "currency": "A$"
    },
    "movingAverages": {
      "ma50": {
        "value": 12.4,
        "date": "14 Feb 2026"
      },
      "ma200": {
        "value": 13.8,
        "date": "14 Feb 2026"
      },
      "crossover": {
        "type": "Death Cross",
        "date": "Jul 2025",
        "description": "50-day MA crossed below 200-day MA in July 2025, confirming downtrend. Price recently reclaimed 50-day MA, potential early bottoming signal."
      },
      "priceVsMa50": 3.6,
      "priceVsMa200": -6.9
    },
    "trend": {
      "direction": "Downtrend (moderating)",
      "duration": "10 months",
      "structure": "Sharp downtrend from $17.50 peak (Apr 2025) to $10.00 low (Dec 2025), followed by base-building between $11.50-$13.50. Lower highs sequence may be breaking with recent strength above $12.80. Early bottoming signals present.",
      "peak": {
        "price": 17.5,
        "date": "Apr 2025"
      },
      "trough": {
        "price": 10,
        "date": "Dec 2025"
      },
      "drawdown": -26.6
    },
    "keyLevels": {
      "support": {
        "price": 11.5,
        "method": "Double bottom formation + volume support cluster"
      },
      "resistance": {
        "price": 14,
        "method": "200-day MA + prior support turned resistance"
      },
      "fiftyTwoWeekHigh": {
        "price": 17.5,
        "date": "Apr 2025"
      },
      "fiftyTwoWeekLow": {
        "price": 10,
        "date": "Dec 2025"
      }
    },
    "volume": {
      "latestVs20DayAvg": 0.15,
      "latestDate": "14 Feb 2026",
      "priorSpikes": [
        {
          "period": "Aug 2024",
          "ratio": 3.5,
          "context": "FY24 results — margin miss triggered 12% sell-off on heavy volume"
        },
        {
          "period": "Dec 2025",
          "ratio": 2.8,
          "context": "Insider buying disclosed — CEO/CFO purchases sparked 15% rally from $10.00 low"
        }
      ]
    },
    "volatility": {
      "latestDailyRange": {
        "high": 13.1,
        "low": 12.6,
        "date": "14 Feb 2026"
      },
      "latestRangePercent": 3.88,
      "avgDailyRangePercent30": 3.2,
      "avgDailyRangePercent90": 3.5
    },
    "meanReversion": {
      "vsMa50": 3.6,
      "vsMa200": -6.9,
      "rangePosition": 38,
      "rangeHigh": 17.5,
      "rangeLow": 10
    },
    "inflectionPoints": [
      {
        "date": "Aug 2024",
        "price": 16,
        "event": "FY24 results — margin miss, stock fell 12%"
      },
      {
        "date": "Nov 2024",
        "price": 12,
        "event": "Capital Markets Day — mixed reception, range-bound"
      },
      {
        "date": "Dec 2025",
        "price": 10,
        "event": "Capitulation low — insider buying sparked recovery rally"
      }
    ],
    "relativePerformance": {
      "vsIndex": {
        "name": "S&P/ASX 200",
        "period": "12 months",
        "stockReturn": -26.6,
        "indexReturn": 6.9,
        "relativeReturn": -33.5
      },
      "vsSector": {
        "name": "S&P/ASX Energy",
        "period": "12 months",
        "stockReturn": -26.6,
        "sectorReturn": -2.3,
        "relativeReturn": -24.3
      }
    }
  },
  "footer": {
    "disclaimer": "This report is generated by Continuum Intelligence for informational purposes only and does not constitute financial advice. All data sourced from public filings, broker research, and third-party providers. Verify independently before making investment decisions.",
    "domainCount": "10 of 10",
    "hypothesesCount": "4 Active"
  },
  "hero": {
    "embedded_thesis": "At A$12.85, the price embeds persistent margin pressure from the Jacobs integration tail, discounting Worley's structural positioning in energy transition engineering services. The 35% decline from 2024 highs reflects project delays and fixed-price contract losses rather than deterioration in the underlying demand environment. The current valuation implies EBITA margins remain below 7.0% and assigns minimal value to the sustainability revenue stream management targets as the long-term earnings driver.",
    "skew": "UPSIDE",
    "skew_description": "Two upside hypotheses contribute. N1 (Energy Transition Winner) at 55% and N2 (Traditional Energy Cash Cow) at 65% together represent the dominant earnings base. Offsetting this, N3 (Margin Pressure) at 60% is persistent and N4 (Cyclical Downturn) at 35% is watching. The probability-weighted skew tilts upside on the basis that the margin headwind is finite and the revenue base is structural.",
    "position_in_range": {
      "current_price": 12.85,
      "worlds": [
        {
          "label": "Energy Capex Correction",
          "price": 7,
          "gap_pct": 0
        },
        {
          "label": "Margin Drag Continues",
          "price": 10.5,
          "gap_pct": 0.31
        },
        {
          "label": "Traditional Sustains",
          "price": 15.5,
          "gap_pct": 0.72
        },
        {
          "label": "Transition Winner",
          "price": 18,
          "gap_pct": 1
        }
      ],
      "note": "World prices are indicative — pending full W1–W4 valuation build"
    },
    "next_decision_point": {
      "event": "FY25 EBITA Margin Result",
      "date": "Monitoring — FY25 Results 2H 2026",
      "metric": "EBITA margin as % of revenue; sustainability revenue growth; backlog value",
      "thresholds": "EBITA margin above 7.0% confirms the Jacobs integration drag has cleared and activates N1 re-rating. Margin below 6.5% confirms N3 is structural rather than transitional. Sustainability revenue above 30% of total backlog provides evidence that N1 energy transition positioning is converting to contracted work."
    }
  },
  "current_price": 11.71,
  "last_price_update": "2026-02-26T08:58:27.342Z"
}